zeranemesis/Marioparty4/partyboard/src/REL/m406Dll/map.c
#include "ext_math.h"
#include "game/audio.h"
#include "game/disp.h"
#include "game/gamework_data.h"
#include "game/hu3d.h"
#include "game/sprite.h"

#include "REL/m406Dll.h"

#ifndef __MWERKS__
#include <game/frand.h>
#include <string.h>
#endif

typedef struct UnkM406Struct {
    /* 0x00 */ u8 unk_00;
    /* 0x01 */ u8 unk_01;
    /* 0x02 */ char unk02[2];
    /* 0x04 */ float unk_04;
    /* 0x08 */ float unk_08;
    /* 0x0C */ float unk_0C;
    /* 0x10 */ Vec unk_10;
    /* 0x1C */ Vec unk_1C;
    /* 0x28 */ float unk_28;
    /* 0x2C */ float unk_2C;
} UnkM406Struct; /* size = 0x30 */

typedef struct UnkM406Struct3 {
    /* 0x00 */ s32 unk_00;
    /* 0x04 */ float unk_04;
    /* 0x08 */ s32 unk_08;
    /* 0x0C */ s32 unk_0C;
    /* 0x10 */ float unk_10;
    /* 0x14 */ float unk_14;
    /* 0x18 */ Vec unk_18;
    /* 0x24 */ struct UnkM406Struct5 *unk_24;
} UnkM406Struct3; /* size = 0x28 */

typedef struct UnkM406Struct4 {
    /* 0x00 */ s32 unk_00;
    /* 0x04 */ s32 unk_04;
    /* 0x08 */ s32 unk_08;
    /* 0x0C */ s32 unk_0C;
    /* 0x10 */ float unk_10;
    /* 0x14 */ float unk_14;
    /* 0x18 */ float unk_18;
    /* 0x1C */ float unk_1C;
    /* 0x20 */ float unk_20;
    /* 0x24 */ float unk_24;
    /* 0x28 */ float unk_28;
    /* 0x2C */ float unk_2C;
    /* 0x30 */ Vec unk_30;
    /* 0x3C */ Vec unk_3C;
} UnkM406Struct4; /* size = 0x48 */

typedef struct UnkM406Unk120Struct {
    /* 0x00 */ s32 unk_00;
    /* 0x04 */ s32 unk_04;
    /* 0x08 */ s32 unk_08;
    /* 0x0C */ float unk_0C;
    /* 0x10 */ float unk_10;
    /* 0x14 */ float unk_14;
    /* 0x18 */ float unk_18;
    /* 0x1C */ float unk_1C;
    /* 0x20 */ s32 unk_20;
    /* 0x24 */ s32 unk_24;
    /* 0x28 */ s32 unk_28;
    /* 0x2C */ UnkM406Struct3 *unk_2C;
    /* 0x30 */ UnkM406Struct4 *unk_30;
    /* 0x34 */ Vec unk_34;
    /* 0x40 */ Vec unk_40;
    /* 0x4C */ Mtx unk_4C;
    /* 0x7C */ s32 unk_7C;
    /* 0x80 */ s32 unk_80;
    /* 0x84 */ Vec *unk_84;
    /* 0x88 */ Vec *unk_88;
    /* 0x8C */ Vec2f *unk_8C;
    /* 0x90 */ GXColor *unk_90;
    /* 0x94 */ UnkM406Struct *unk_94;
    /* 0x98 */ s32 unk_98;
    /* 0x9C */ s16 (*unk_9C)[4];
    /* 0xA0 */ u32 unk_A0;
    /* 0xA4 */ void *unk_A4;
    /* 0xA8 */ u8 *unk_A8;
    /* 0xAC */ s32 unk_AC;
    /* 0xB0 */ s32 unk_B0;
    /* 0xB4 */ float unk_B4;
    /* 0xB8 */ float unk_B8;
    /* 0xBC */ u8 *unk_BC;
    /* 0xC0 */ s32 unk_C0;
    /* 0xC4 */ s32 unk_C4;
    /* 0xC8 */ float unk_C8;
    /* 0xCC */ float unk_CC;
} UnkM406Unk120Struct; /* size = 0xD0 */

typedef struct UnkM406Struct5 {
    /* 0x00 */ s16 unk_00;
    /* 0x02 */ s16 unk_02;
    /* 0x04 */ Vec unk_04;
    /* 0x10 */ float unk_10;
    /* 0x14 */ float unk_14;
    /* 0x18 */ float unk_18;
    /* 0x1C */ char unk1C[0xC];
    /* 0x28 */ float unk_28;
    /* 0x2C */ float unk_2C;
    /* 0x30 */ Vec unk_30;
    /* 0x3C */ GXColor unk_3C;
    /* 0x40 */ s32 unk_40;
} UnkM406Struct5; /* size = 0x44 */ // most likely UnkM426Struct8

typedef struct UnkM406Struct9 {
    /* 0x00 */ s16 unk00;
    /* 0x02 */ s16 unk_02;
    /* 0x04 */ s16 unk_04;
    /* 0x06 */ char unk06[2];
} UnkM406Struct9; /* size = 0x08 */

struct UnkM406Unk120Struct2;
typedef void (*UnkM406Unk120Struct2Hook)(struct Hu3DModel_s *, struct UnkM406Unk120Struct2 *, Mtx);

typedef struct UnkM406Unk120Struct2 {
    /* 0x00 */ s16 unk_00;
    /* 0x02 */ s16 unk_02;
    /* 0x04 */ char unk04[0x18];
    /* 0x1C */ UnkM406Struct9 *unk_1C;
    /* 0x20 */ u8 unk_20;
    /* 0x21 */ u8 unk_21;
    /* 0x22 */ u8 unk_22;
    /* 0x23 */ char unk23;
    /* 0x24 */ s16 unk_24;
    /* 0x26 */ s16 unk_26;
    /* 0x28 */ s32 unk_28;
    /* 0x2C */ s32 unk_2C;
    /* 0x30 */ u32 unk_30;
    /* 0x34 */ u32 unk_34;
    /* 0x38 */ ANIMDATA *unk_38;
    /* 0x3C */ UnkM406Struct5 *unk_3C;
    /* 0x40 */ Vec *unk_40;
    /* 0x44 */ Vec2f *unk_44;
    /* 0x48 */ void *unk_48;
    /* 0x4C */ UnkM406Unk120Struct2Hook unk_4C;
    /* 0x50 */ HU3DMODEL *unk_50;
} UnkM406Unk120Struct2; /* size = 0x54 */ // strongly assumed to be a copy of UnkModelDataUnk120Struct

typedef struct UnkM406Struct6 {
    /* 0x00 */ s32 unk_00;
    /* 0x04 */ s32 unk_04;
} UnkM406Struct6; /* size = 0x08 */ // probably the same as UnkM426Struct13

typedef struct UnkM406Struct7 {
    /* 0x00 */ u8 unk_00;
    /* 0x01 */ u8 unk_01;
    /* 0x02 */ char unk02[2];
    /* 0x04 */ s32 unk_04;
    /* 0x08 */ s32 unk_08;
    /* 0x0C */ float unk_0C;
    /* 0x10 */ float unk_10;
    /* 0x14 */ float unk_14;
    /* 0x18 */ float unk_18;
    /* 0x1C */ Mtx unk_1C;
} UnkM406Struct7; /* size = 0x4C */

typedef struct UnkM406Struct8 {
    /* 0x00 */ ANIMDATA *unk_00;
    /* 0x04 */ ANIMDATA *unk_04;
    /* 0x08 */ ANIMDATA *unk_08;
    /* 0x0C */ ANIMDATA *unk_0C;
    /* 0x10 */ s32 unk_10;
    /* 0x14 */ s32 unk_14;
    /* 0x18 */ s32 unk_18;
    /* 0x1C */ s32 unk_1C;
    /* 0x20 */ s32 unk_20;
    /* 0x24 */ float unk_24;
    /* 0x28 */ float unk_28;
} UnkM406Struct8; /* size = 0x2C */

typedef struct UnkM406Struct10 {
    /* 0x00 */ s32 unk_00;
    /* 0x04 */ s32 unk_04;
    /* 0x08 */ ANIMDATA *unk_08;
} UnkM406Struct10; /* size = 0x0C */

void fn_1_292C(omObjData *object);
void fn_1_2C24(omObjData *object);
void fn_1_3158(void);
void fn_1_4568(void);
void fn_1_45BC(HU3DMODEL *arg0, Mtx arg1);
void fn_1_6304(HU3DMODEL *arg0, Mtx arg1);
#ifdef NON_MATCHING
void fn_1_64F8(UnkM406Struct2 *arg0, float var_f31);
#else
void fn_1_64F8(UnkM406Struct2 *arg0);
#endif
s32 fn_1_66F4(float arg8, float *arg0);
void fn_1_67CC(HU3DMODEL *arg0);
void fn_1_6F24(void);
void fn_1_6FFC(void);
void fn_1_717C(void);
s32 fn_1_71C4(Vec arg0, Vec arg1, float arg8, float arg9, GXColor arg2);
void fn_1_7718(void);
void fn_1_77F0(void);
void fn_1_79B0(void);
s32 fn_1_79F8(Vec arg0, Vec arg1, float arg8, float arg9, GXColor arg2);
UnkM406Struct5 *fn_1_7B2C(s32 arg0);
void fn_1_7B9C(void);
void fn_1_7C4C(void);
void fn_1_7DAC(void);
s32 fn_1_7DB0(Vec arg0, Vec arg1, float arg8, GXColor arg2);
void fn_1_7ED0(void);
void fn_1_7F80(void);
void fn_1_8100(void);
s32 fn_1_8104(Vec arg0, Vec arg1, float arg8, GXColor arg2);
void fn_1_8244(s32 arg0, s32 arg1, float arg8, float arg9);
void fn_1_8F98(void);
void fn_1_91E0(void);
void fn_1_94BC(void);
void fn_1_9F78(void);
void fn_1_A278(void);
void fn_1_A2C8(HU3DMODEL *arg0, UnkM406Unk120Struct2 *arg1, Mtx arg2);
void fn_1_ADB4(HU3DMODEL *arg0, Mtx arg1);
void fn_1_B1E0(float arg8);
s16 fn_1_B474(ANIMDATA *arg0, s16 arg1);
void fn_1_BC18(HU3DMODEL *arg0, Mtx arg1);
s16 fn_1_C4F4(s16 arg0);
void fn_1_C86C(HU3DMODEL *arg0, Mtx arg1);
void fn_1_CDD8(s32 arg0, float arg8, float arg9, float argA, float argB);
void fn_1_CF24(s32 arg0, u8 arg1, u8 arg2, u8 arg3);
s16 fn_1_D06C(HU3DMODEL *arg0, Mtx arg1, Mtx arg2, float arg8);
void fn_1_D13C(HU3DLIGHT *arg0, s16 arg1, Mtx arg2, Mtx arg3, float arg8);
void fn_1_D488(float arg8, Vec *arg0, Vec *arg1, Vec *arg2);
void fn_1_D518(Mtx arg0, Vec *arg1);
float fn_1_D5CC(Vec *arg0, Vec *arg1, float arg8, float arg9);

SHARED_SYM extern u32 GlobalCounter;

Vec lbl_1_data_F0[0x46] = {
    { -495.876f, 50.005f, -0.0f },
    { -500.023f, -2841.226f, -5007.74f },
    { -502.015f, -7170.411f, -12506.11f },
    { -515.622f, -8314.231f, -14487.27f },
    { -515.6f, -8761.908f, -15262.67f },
    { -508.661f, -9195.703f, -16014.02f },
    { -494.762f, -9629.499f, -16765.38f },
    { -473.947f, -10063.294f, -17516.73f },
    { -471.378f, -10495.727f, -18265.73f },
    { -495.719f, -10915.74f, -18993.21f },
    { -552.519f, -11337.781f, -19724.21f },
    { -621.485f, -11611.703f, -20198.66f },
    { -731.018f, -11887.653f, -20676.62f },
    { -950.131f, -12303.607f, -21397.07f },
    { -1209.766f, -12735.795f, -22145.64f },
    { -1469.474f, -13170.012f, -22897.73f },
    { -1627.69f, -13466.252f, -23410.83f },
    { -1757.595f, -13772.641f, -23941.51f },
    { -1838.731f, -14079.026f, -24472.19f },
    { -1871.186f, -14393.528f, -25016.92f },
    { -1834.734f, -14703.97f, -25554.62f },
    { -1749.541f, -15014.414f, -26092.33f },
    { -1623.78f, -15312.685f, -26608.94f },
    { -1384.433f, -15761.101f, -27385.62f },
    { -1124.798f, -16191.259f, -28130.68f },
    { -775.859f, -16769.535f, -29132.28f },
    { -568.923f, -17183.457f, -29849.22f },
    { -398.537f, -17621.73f, -30608.33f },
    { -187.485f, -18055.945f, -31360.41f },
    { 96.491f, -18634.223f, -32362.02f },
    { 254.886f, -19042.057f, -33068.41f },
    { 315.738f, -19315.977f, -33542.85f },
    { 331.965f, -19581.783f, -34003.24f },
    { 291.397f, -19839.473f, -34449.57f },
    { 189.969f, -20091.07f, -34885.35f },
    { -12.871f, -20340.645f, -35317.62f },
    { -325.245f, -20598.332f, -35763.96f },
    { -747.265f, -20870.219f, -36234.88f },
    { -1230.024f, -21152.258f, -36723.38f },
    { -2276.853f, -21730.535f, -37724.99f },
    { -2759.968f, -22028.799f, -38241.6f },
    { -3189.989f, -22343.3f, -38786.33f },
    { -3514.533f, -22669.979f, -39352.15f },
    { -3620.335f, -22840.408f, -39647.35f },
    { -3693.358f, -23018.965f, -39956.61f },
    { -3705.528f, -23193.463f, -40258.85f },
    { -3693.358f, -23367.96f, -40561.09f },
    { -3551.37f, -23698.695f, -41133.94f },
    { -3307.945f, -24019.275f, -41689.2f },
    { -2995.571f, -24323.633f, -42216.36f },
    { -2646.686f, -24621.904f, -42732.99f },
    { -1920.124f, -25200.174f, -43734.58f },
    { -1457.648f, -25612.07f, -44448.0f },
    { -1238.474f, -25871.78f, -44897.83f },
    { -1084.316f, -26137.584f, -45358.22f },
    { -958.555f, -26417.594f, -45843.21f },
    { -861.049f, -26697.596f, -46328.19f },
    { -783.97f, -26979.635f, -46816.69f },
    { -715.004f, -27261.672f, -47305.2f },
    { -617.584f, -27979.957f, -48549.3f },
    { -548.553f, -28700.271f, -49796.93f },
    { -491.712f, -29278.535f, -50798.51f },
    { -475.485f, -29856.814f, -51800.12f },
    { -479.514f, -30433.059f, -52798.2f },
    { -505.531f, -34619.363f, -60049.28f },
    { -513.632f, -34659.062f, -60100.39f },
    { -509.573f, -34721.215f, -60151.54f },
    { -509.589f, -34805.496f, -60191.15f },
    { -509.587f, -34970.055f, -60233.17f },
    { -509.591f, -45195.266f, -61377.84f },
};

Vec lbl_1_data_438[0x46] = {
    { 497.979f, 49.997f, 0.0f },
    { 501.235f, -2841.251f, -5007.79f },
    { 497.983f, -7170.06f, -12505.5f },
    { 479.876f, -8314.231f, -14487.27f },
    { 479.899f, -8761.908f, -15262.67f },
    { 486.837f, -9195.703f, -16014.02f },
    { 500.736f, -9629.499f, -16765.38f },
    { 521.552f, -10063.294f, -17516.73f },
    { 524.121f, -10495.727f, -18265.73f },
    { 503.13f, -10936.027f, -19028.35f },
    { 446.486f, -11379.887f, -19797.14f },
    { 364.665f, -11685.236f, -20326.02f },
    { 245.082f, -11987.438f, -20849.45f },
    { 18.48f, -12434.451f, -21623.7f },
    { -252.156f, -12875.162f, -22387.03f },
    { -497.617f, -13300.134f, -23123.1f },
    { -655.129f, -13580.305f, -23608.37f },
    { -768.419f, -13847.879f, -24071.83f },
    { -843.945f, -14131.193f, -24562.54f },
    { -875.687f, -14393.528f, -25016.92f },
    { -850.353f, -14653.739f, -25467.62f },
    { -768.533f, -14927.61f, -25941.98f },
    { -642.655f, -15201.48f, -26416.33f },
    { -428.664f, -15620.156f, -27141.5f },
    { -170.569f, -16051.424f, -27888.48f },
    { 188.182f, -16636.941f, -28902.62f },
    { 408.467f, -17083.947f, -29676.86f },
    { 572.186f, -17512.059f, -30418.37f },
    { 786.178f, -17940.18f, -31159.9f },
    { 1075.696f, -18525.695f, -32174.04f },
    { 1245.631f, -18972.703f, -32948.28f },
    { 1315.06f, -19274.898f, -33471.7f },
    { 1327.648f, -19592.842f, -34022.39f },
    { 1283.591f, -19907.637f, -34567.64f },
    { 1157.714f, -20235.021f, -35134.68f },
    { 887.077f, -20562.406f, -35701.73f },
    { 496.857f, -20883.496f, -36257.87f },
    { 31.029f, -21188.842f, -36786.75f },
    { -491.693f, -21487.889f, -37304.71f },
    { -1517.594f, -22057.664f, -38291.59f },
    { -1958.808f, -22331.527f, -38765.94f },
    { -2323.853f, -22595.953f, -39223.93f },
    { -2588.195f, -22850.938f, -39665.58f },
    { -2651.134f, -22964.264f, -39861.87f },
    { -2695.42f, -23074.441f, -40052.7f },
    { -2714.302f, -23187.768f, -40248.99f },
    { -2689.126f, -23316.832f, -40472.53f },
    { -2594.718f, -23552.928f, -40881.46f },
    { -2393.337f, -23814.195f, -41334.0f },
    { -2116.406f, -24081.771f, -41797.45f },
    { -1782.831f, -24371.38f, -42299.07f },
    { -1059.036f, -24941.158f, -43285.95f },
    { -561.404f, -25391.299f, -44065.62f },
    { -290.767f, -25709.24f, -44616.31f },
    { -108.245f, -26024.033f, -45161.55f },
    { 23.926f, -26323.088f, -45679.52f },
    { 130.922f, -26625.29f, -46202.95f },
    { 212.947f, -26918.023f, -46709.98f },
    { 275.886f, -27213.93f, -47222.51f },
    { 376.588f, -27941.104f, -48482.01f },
    { 452.187f, -28658.824f, -49725.14f },
    { 508.832f, -29241.193f, -50733.83f },
    { 521.5f, -29814.105f, -51726.14f },
    { 515.985f, -30433.059f, -52798.2f },
    { 503.81f, -34617.785f, -60046.38f },
    { 495.709f, -34657.49f, -60097.48f },
    { 499.768f, -34719.64f, -60148.64f },
    { 499.752f, -34803.92f, -60188.25f },
    { 499.754f, -34968.48f, -60230.3f },
    { 499.75f, -45193.69f, -61374.92f },
};

Vec lbl_1_data_780[3] = {
    { 725.7116f, -20607.168f, -35686.844f },
    { -3135.352f, -23367.234f, -40490.824f },
    { -282.94498f, -26285.674f, -45528.754f },
};

