zeranemesis/Marioparty4/partyboard/src/REL/m406Dll/map.c
s16 lbl_1_data_7A4 = -1;

s32 lbl_1_data_7A8[7] = {
    DATA_MAKE_NUM(DATADIR_M406, 35),
    DATA_MAKE_NUM(DATADIR_M406, 36),
    DATA_MAKE_NUM(DATADIR_M406, 37),
    DATA_MAKE_NUM(DATADIR_M406, 38),
    DATA_MAKE_NUM(DATADIR_M406, 39),
    DATA_MAKE_NUM(DATADIR_M406, 40),
    DATA_MAKE_NUM(DATADIR_M406, 41),
};

s32 lbl_1_data_7C4[7] = {
    DATA_MAKE_NUM(DATADIR_M406, 48),
    DATA_MAKE_NUM(DATADIR_M406, 49),
    DATA_MAKE_NUM(DATADIR_M406, 50),
    DATA_MAKE_NUM(DATADIR_M406, 51),
    DATA_MAKE_NUM(DATADIR_M406, 52),
    DATA_MAKE_NUM(DATADIR_M406, 53),
    0,
};

s32 lbl_1_data_7E0[6] = {
    DATA_MAKE_NUM(DATADIR_M406, 42),
    DATA_MAKE_NUM(DATADIR_M406, 43),
    DATA_MAKE_NUM(DATADIR_M406, 44),
    DATA_MAKE_NUM(DATADIR_M406, 45),
    DATA_MAKE_NUM(DATADIR_M406, 46),
    DATA_MAKE_NUM(DATADIR_M406, 47),
};

Vec lbl_1_data_7F8 = { 0.0f, 0.0f, 0.0f };

Vec lbl_1_data_804 = { -1.0f, -2.0f, -1.0f };

#if VERSION_NTSC
GXColor lbl_1_data_810 = { 255, 255, 255, 255 };
#else
GXColor lbl_1_data_810 = { 186, 186, 186, 255 };
#endif

Vec lbl_1_data_814 = { 0.0f, 2500.0f, -500.0f };

Vec lbl_1_data_820 = { 0.0f, 1.0f, 0.0f };

Vec lbl_1_data_82C = { 0.0f, 0.0f, 0.0f };

Vec lbl_1_data_838 = { 0.0f, 0.0f, 0.0f };

Vec lbl_1_data_844 = { 0.0f, 1.0f, -1.0f };

GXColor lbl_1_data_850[8] = {
    { 0xFF, 0xFF, 0xFF, 0xFF },
    { 0xC4, 0x2F, 0, 0 },
    { 0x45, 0x1C, 0x40, 0 },
    { 0xC4, 0x2F, 0, 0 },
    { 0, 0, 0, 0 },
    { 0, 0, 0, 0 },
    { 0, 0, 0, 0 },
    { 0x80, 0x80, 0x80, 0xFF },
};

Process *lbl_1_bss_D4;
omObjData *lbl_1_bss_D0;
omObjData *lbl_1_bss_CC;
omObjData *lbl_1_bss_C8;
omObjData *lbl_1_bss_C4;
s32 lbl_1_bss_C0;
s32 lbl_1_bss_BC;
UnkM406Struct2 *lbl_1_bss_B8;
s32 lbl_1_bss_B4;
UnkM406Struct10 *lbl_1_bss_B0;
UnkM406Struct10 *lbl_1_bss_AC;
UnkM406Struct6 *lbl_1_bss_A8;
UnkM406Struct6 *lbl_1_bss_A4;
UnkM406Struct7 *lbl_1_bss_A0;
UnkM406Struct8 *lbl_1_bss_9C;
s32 lbl_1_bss_98;
char lbl_1_bss_8C[0xC];
UnkM406Struct5 lbl_1_bss_48;
Vec lbl_1_bss_3C;
s32 lbl_1_bss_30[3];

SHARED_SYM extern HU3DLIGHT Hu3DLocalLight[0x20];

#ifdef TARGET_PC
/* Rendering can run at up to 240 Hz while Mario Party 4 simulation remains
 * fixed at 60 Hz.  Avalanche historically advanced its snow and slope
 * effects from a draw hook, so use the number of simulation ticks represented
 * by this presentation instead of advancing once per rendered frame. */
SHARED_SYM extern int PartyBoard_SimulationTicksThisFrame;
static u32 m406LastEffectSimulationCounter = (u32)-1;
#endif

omObjData *fn_1_2308(Process *arg0)
{
    s32 var_r31;
    s32 var_r30;
    s32 var_r28;

    lbl_1_bss_D4 = arg0;
    lbl_1_bss_C0 = 0;
    lbl_1_bss_BC = 1;
    lbl_1_bss_98 = -1;
#ifdef TARGET_PC
    m406LastEffectSimulationCounter = (u32)-1;
#endif
    omMakeGroupEx(arg0, 1, 1);
    omMakeGroupEx(arg0, 2, 1);
    omMakeGroupEx(arg0, 3, 1);
    lbl_1_bss_D0 = omAddObjEx(arg0, 127, 0, 0, -1, fn_1_292C);
    var_r28 = Hu3DGLightCreateV(&lbl_1_data_7F8, &lbl_1_data_804, &lbl_1_data_810);
    Hu3DGLightStaticSet(var_r28, 1);
    Hu3DGLightInfinitytSet(var_r28);
    lbl_1_bss_CC = omAddObjEx(arg0, 0x7E, 0x15, 0, 1, fn_1_2C24);
    for (var_r31 = 0; var_r31 < 7; var_r31++) {
        var_r30 = lbl_1_bss_CC->model[var_r31] = Hu3DModelCreateFile(lbl_1_data_7A8[var_r31]);
        Hu3DModelShadowMapSet(var_r30);
        Hu3DModelAttrSet(var_r30, HU3D_ATTR_DISPOFF);
        if (var_r31 < 6) {
            fn_1_CDD8(var_r30, 1.25f, 1.05f, 1.0f, 1.0f);
        }
        if (var_r31 < 6) {
            var_r30 = Hu3DModelCreateFile(lbl_1_data_7C4[var_r31]);
            lbl_1_bss_CC->model[var_r31 + 7] = var_r30;
        }
        else {
            var_r30 = -1;
            lbl_1_bss_CC->model[var_r31 + 7] = var_r30;
        }
        if (var_r30 != -1) {
            Hu3DModelAttrSet(var_r30, HU3D_ATTR_DISPOFF);
            Hu3DModelLayerSet(var_r30, 5);
        }
    }
    var_r30 = Hu3DModelCreateFile(DATA_MAKE_NUM(DATADIR_M406, 54));
    lbl_1_bss_CC->model[14] = var_r30;
    Hu3DModelPosSet(var_r30, 0.0f, 10.0f, 0.0f);
    Hu3DModelAttrSet(var_r30, HU3D_ATTR_DISPOFF);
    Hu3DModelLayerSet(var_r30, 5);
    lbl_1_bss_C8 = omAddObjEx(arg0, 0x7D, 6, 0, 2, NULL);
    for (var_r31 = 0; var_r31 < 6; var_r31++) {
        lbl_1_bss_C8->model[var_r31] = Hu3DModelCreateFile(lbl_1_data_7E0[var_r31]);
        Hu3DModelAttrSet(lbl_1_bss_C8->model[var_r31], HU3D_ATTR_DISPOFF);
    }
    lbl_1_bss_C4 = omAddObjEx(arg0, 0x7D, 3, 0, 3, NULL);
    lbl_1_bss_C4->trans.x = lbl_1_data_780->x;
    lbl_1_bss_C4->trans.y = lbl_1_data_780->y;
    lbl_1_bss_C4->trans.z = lbl_1_data_780->z;
    lbl_1_bss_C4->scale.x = lbl_1_bss_C4->scale.y = lbl_1_bss_C4->scale.z = 3.0f;
    for (var_r31 = 0; var_r31 < 3; var_r31++) {
        if (var_r31 == 0) {
            lbl_1_bss_C4->model[var_r31] = Hu3DModelCreateFile(DATA_MAKE_NUM(DATADIR_M406, 34));
        }
        else {
            lbl_1_bss_C4->model[var_r31] = Hu3DModelLink(*lbl_1_bss_C4->model);
        }
        Hu3DModelShadowSet(lbl_1_bss_C4->model[var_r31]);
        Hu3DModelScaleSet(lbl_1_bss_C4->model[var_r31], lbl_1_bss_C4->scale.x, lbl_1_bss_C4->scale.y, lbl_1_bss_C4->scale.z);
        Hu3DModelPosSet(lbl_1_bss_C4->model[var_r31], lbl_1_data_780[var_r31].x, lbl_1_data_780[var_r31].y, lbl_1_data_780[var_r31].z);
    }
    fn_1_3158();
    fn_1_6F24();
    fn_1_7718();
    fn_1_7B9C();
    fn_1_7ED0();
    fn_1_8F98();
    lbl_1_bss_30[0] = 1;
    fn_1_9F78();
    fn_1_B104(0.0f);
    fn_1_B1E0(0.0f);
    Hu3DShadowCreate(45.0f, 1000.0f, 250000.0f);
    Hu3DShadowTPLvlSet(0.3f);
    Hu3DShadowPosSet(&lbl_1_data_814, &lbl_1_data_820, &lbl_1_data_82C);
    return lbl_1_bss_D0;
}

void fn_1_292C(omObjData *object)
{
    Vec sp24;
    Vec sp18;
    Vec spC;
    float sp8;

    float var_f31;
    float var_f30;
    float var_f29;

    var_f29 = 1000.0f + CZoom;
    var_f31 = -65.0f;
    var_f30 = 110.0f;
    sp8 = 0.0f;
    spC.x = Center.x;
    spC.y = Center.y;
    spC.z = Center.z;

    sp18.x = spC.x + (var_f29 * (sind(var_f30) * cosd(var_f31)));
    sp18.y = spC.y + (var_f29 * -sind(var_f31));
    sp18.z = spC.z + (var_f29 * (cosd(var_f30) * cosd(var_f31)));
    sp24.x = sind(var_f30) * sind(var_f31);
    sp24.y = cosd(var_f31);
    sp24.z = cosd(var_f30) * sind(var_f31);
    Hu3DShadowPosSet(&sp18, &sp24, &spC);
}

void fn_1_2BEC(void)
{
    fn_1_4568();
    fn_1_717C();
    fn_1_79B0();
    fn_1_7DAC();
    fn_1_8100();
    fn_1_94BC();
    fn_1_A278();
}

void fn_1_2C24(omObjData *object)
{
    float var_f31;

    s32 var_r30;
    s32 var_r29;

    if (!lbl_1_bss_C0) {
        for (var_r30 = 0; var_r30 < 6; var_r30++) {
            var_f31 = -(5000.0f + (10000.0f * var_r30));
            if (fabs(Center.z - var_f31) > 10000.0 || !lbl_1_bss_BC) {
                if (object->model[var_r30] != -1) {
                    Hu3DModelAttrSet(object->model[var_r30], HU3D_ATTR_DISPOFF);
                }
                var_r29 = var_r30 + 7;
                if (object->model[var_r29] != -1) {
                    Hu3DModelAttrSet(object->model[var_r29], HU3D_ATTR_DISPOFF);
                }
            }
            else {
                if (object->model[var_r30] != -1) {
                    Hu3DModelAttrReset(object->model[var_r30], HU3D_ATTR_DISPOFF);
                }
                var_r29 = var_r30 + 7;
                if (object->model[var_r29] != -1) {
                    Hu3DModelAttrReset(object->model[var_r29], HU3D_ATTR_DISPOFF);
                }
            }
        }
        var_r29 = 14;
        if (object->model[var_r29] != -1) {
            var_f31 = 25000.0f;
            if (fabs(Center.z - var_f31) < 15000.0) {
                Hu3DModelAttrSet(object->model[var_r29], HU3D_ATTR_DISPOFF);
            }
            else {
                Hu3DModelAttrReset(object->model[var_r29], HU3D_ATTR_DISPOFF);
            }
        }
        var_r29 = 6;
        if (object->model[var_r29] != -1) {
            Hu3DModelAttrSet(object->model[var_r29], HU3D_ATTR_DISPOFF);
        }
        for (var_r30 = 0; var_r30 < 3; var_r30++) {
            if (fabs(Center.z - lbl_1_data_780[var_r30].z) > 10000.0) {
                Hu3DModelAttrSet(lbl_1_bss_C4->model[var_r30], HU3D_ATTR_DISPOFF);
            }
            else {
                Hu3DModelAttrReset(lbl_1_bss_C4->model[var_r30], HU3D_ATTR_DISPOFF);
            }
        }
        return;
    }
    for (var_r30 = 0; var_r30 < 6; var_r30++) {
        if (object->model[var_r30] != -1) {
            Hu3DModelAttrSet(object->model[var_r30], HU3D_ATTR_DISPOFF);
        }
        var_r29 = var_r30 + 7;
        if (object->model[var_r29] != -1) {
            Hu3DModelAttrSet(object->model[var_r29], HU3D_ATTR_DISPOFF);
        }
    }
    var_r29 = 6;
    if (object->model[var_r29] != -1) {
        Hu3DModelAttrReset(object->model[var_r29], HU3D_ATTR_DISPOFF);
    }
    for (var_r30 = 0; var_r30 < 3; var_r30++) {
        Hu3DModelAttrSet(lbl_1_bss_C4->model[var_r30], HU3D_ATTR_DISPOFF);
    }
}

void fn_1_3064(s32 arg0)
{
    s32 var_r31;

    if (lbl_1_bss_C0 = arg0) {
        for (var_r31 = 0; var_r31 < 6; var_r31++) {
            if (lbl_1_bss_CC->model[var_r31] != -1) {
                Hu3DModelKill(lbl_1_bss_CC->model[var_r31]);
            }
            lbl_1_bss_CC->model[var_r31] = -1;
        }
        if (lbl_1_bss_CC->model[6] == -1) {
            lbl_1_bss_CC->model[6] = Hu3DModelCreateFile(DATA_MAKE_NUM(DATADIR_M406, 41));
        }
    }
}

void fn_1_3158(void)
{
    UnkM406Struct2 *sp10[2]; // TODO sp10 should probably be a void*
    s32 sp8[2];

    float var_f31;
    float var_f30;
    float var_f29;
    float var_f28;

    UnkM406Unk120Struct *var_r31;
    UnkM406Struct *var_r30;
    s32 var_r29;
    UnkM406Struct4 *var_r28;
    UnkM406Struct3 *var_r27;
    HU3DMODEL *var_r26;
    s32 var_r25;
    Vec *var_r24;
    GXColor *var_r23;
    s16(*var_r22)[4];
    Vec *var_r21;
    Vec2f *var_r20;
    s32 var_r19;
    void *var_r18;
    HU3DMODEL *var_r17;

