zeranemesis/Marioparty4/partyboard/src/REL/m406Dll/map.c
#ifdef NON_MATCHING
    var_f31 = 0.0f;
#endif

    var_r19 = lbl_1_data_7A4 = Hu3DHookFuncCreate(fn_1_45BC);
    var_r26 = &Hu3DData[var_r19];
    var_r31 = HuMemDirectMallocNum(HEAP_DATA, sizeof(UnkM406Unk120Struct), var_r26->mallocNo);
    var_r26->hookData = var_r31;
    memset(var_r31, 0, sizeof(UnkM406Unk120Struct));

    sp8[0] = Hu3DHookFuncCreate(fn_1_6304);
    Hu3DModelLayerSet(sp8[0], 7);
    var_r17 = &Hu3DData[sp8[0]];
    var_r17->hookData = var_r31;

    sp8[1] = Hu3DLLightCreateV(var_r19, &lbl_1_data_838, &lbl_1_data_844, lbl_1_data_850);
    Hu3DLLightStaticSet(var_r19, sp8[1], 1);
    Hu3DLLightInfinitytSet(var_r19, sp8[1]);

    var_r31->unk_00 = 0;
    var_r31->unk_04 = var_r19;
    var_r31->unk_08 = 0;
    var_r31->unk_0C = 0.0f;
    var_r31->unk_10 = 0.0f;
    var_r31->unk_14 = 2000.0f;
    var_r31->unk_28 = 0;
    var_r31->unk_A8 = HuDataReadNum(DATA_MAKE_NUM(DATADIR_M406, 61), MEMORY_DEFAULT_NUM);
    var_r31->unk_AC = 0x80;
    var_r31->unk_B0 = 0x80;
    var_r31->unk_B4 = 0.0f;
    var_r31->unk_B8 = 0.0f;
    var_r31->unk_BC = HuDataReadNum(DATA_MAKE_NUM(DATADIR_M406, 62), MEMORY_DEFAULT_NUM);
    var_r31->unk_C0 = 0x80;
    var_r31->unk_C4 = 0x80;
    var_r31->unk_C8 = 0.0f;
    var_r31->unk_CC = 0.0f;
    var_r31->unk_2C = HuMemDirectMallocNum(HEAP_DATA, 105 * sizeof(UnkM406Struct3), var_r26->mallocNo);
    memset(var_r31->unk_2C, 0, 105 * sizeof(UnkM406Struct3));
    var_r27 = var_r31->unk_2C;

    for (var_r29 = 0; var_r29 < 105; var_r29++, var_r27++) {
        var_r27->unk_00 = var_r29 / 3;
        var_r27->unk_04 = 0.33333334f * (var_r29 % 3);
        switch (var_r29 % 4) {
            case 0:
                var_r25 = var_r27->unk_08 = frand() & 0x1F;
                break;
            case 1:
                var_r27->unk_08 = var_r25 + 10;
                break;
            default:
                var_r27->unk_08 = var_r25 + 20;
                break;
        }
        var_r27->unk_0C = -1;
        var_r27->unk_10 = 0.0f;
        if (var_r29 == 0 || var_r29 == 104) {
            var_r27->unk_14 = 0.3f;
        }
        if (var_r29 == 1 || var_r29 == 103) {
            var_r27->unk_14 = 0.6f;
        }
        else {
            var_r27->unk_14 = 1.0f;
        }
        var_r27->unk_18.x = var_r27->unk_18.y = var_r27->unk_18.z = 0.0f;
        var_r27->unk_24 = 0;
    }
    var_r31->unk_30 = HuMemDirectMallocNum(HEAP_DATA, 12 * sizeof(UnkM406Struct4), var_r26->mallocNo);
    memset(var_r31->unk_30, 0, 12 * sizeof(UnkM406Struct4));
    var_r28 = var_r31->unk_30;

    for (var_r29 = 0; var_r29 < 12; var_r29++, var_r28++) {
        switch (var_r29) {
            case 0:
                var_r28->unk_00 = Hu3DModelCreateFile(DATA_MAKE_NUM(DATADIR_M406, 56));
                break;
            case 1:
                var_r28->unk_00 = Hu3DModelCreateFile(DATA_MAKE_NUM(DATADIR_M406, 57));
                break;
            case 2:
                var_r28->unk_00 = Hu3DModelCreateFile(DATA_MAKE_NUM(DATADIR_M406, 58));
                break;
            default:
                var_r28->unk_00 = Hu3DModelLink(var_r31->unk_30[var_r29 % 3].unk_00);
                break;
        }
        if (var_r29 < 3) {
            fn_1_CF24(var_r28->unk_00, 184, 207, 214);
        }
        var_r28->unk_04 = frand() & 1;
        var_r28->unk_08 = 0;
        var_r28->unk_0C = frand() % 60;
        var_r28->unk_10 = 0.2f + (0.6f * (0.007874016f * (frand() & 0x7F)));
        var_r28->unk_14 = var_r28->unk_18 = 0.0f;
        var_r28->unk_1C = 0.0f;
        var_r28->unk_20 = var_r28->unk_24 = 0.0f;
        var_r28->unk_28 = 0.0f;
        var_r28->unk_2C = 0.0f;
        var_r28->unk_3C.x = var_r28->unk_3C.y = var_r28->unk_3C.z = 0.0f;
    }

    var_r31->unk_34.x = var_r31->unk_34.y = var_r31->unk_34.z = 0.0f;
    var_r31->unk_40.x = var_r31->unk_40.y = var_r31->unk_40.z = 0.0f;
    var_r31->unk_7C = 0;

    var_r31->unk_80 = 1050;
    var_r31->unk_84 = HuMemDirectMallocNum(HEAP_DATA, var_r31->unk_80 * sizeof(Vec), var_r26->mallocNo);
    memset(var_r31->unk_84, 0, var_r31->unk_80 * sizeof(Vec));

    var_r31->unk_88 = HuMemDirectMallocNum(HEAP_DATA, var_r31->unk_80 * sizeof(Vec), var_r26->mallocNo);
    memset(var_r31->unk_88, 0, var_r31->unk_80 * sizeof(Vec));

    var_r31->unk_8C = HuMemDirectMallocNum(HEAP_DATA, var_r31->unk_80 * sizeof(Vec2f), var_r26->mallocNo);
    memset(var_r31->unk_8C, 0, var_r31->unk_80 * sizeof(Vec2f));

    var_r31->unk_90 = HuMemDirectMallocNum(HEAP_DATA, var_r31->unk_80 * sizeof(GXColor), var_r26->mallocNo);
    memset(var_r31->unk_90, 0, var_r31->unk_80 * sizeof(GXColor));

    var_r31->unk_94 = HuMemDirectMallocNum(HEAP_DATA, var_r31->unk_80 * sizeof(UnkM406Struct), var_r26->mallocNo);
    memset(var_r31->unk_94, 0, var_r31->unk_80 * sizeof(UnkM406Struct));

    var_r31->unk_98 = 986;
    var_r31->unk_9C = HuMemDirectMallocNum(HEAP_DATA, var_r31->unk_98 * 8, var_r26->mallocNo);
    memset(var_r31->unk_9C, 0, var_r31->unk_98 * 8);

    var_r24 = var_r31->unk_84;
    var_r21 = var_r31->unk_88;
    var_r20 = var_r31->unk_8C;
    var_r23 = var_r31->unk_90;
    var_r30 = var_r31->unk_94;
    var_f30 = -500.0f;
    var_f29 = -1000.0f;
    var_f28 = 0.0f;
    for (var_r29 = 0; var_r29 < 30; var_r29++) {
        for (var_r25 = 0; var_r25 < 35; var_r25++) {
            var_r24->x = var_f30;
            var_r24->y = var_f28;
            var_r24->z = var_f29;

            var_f30 += 29.411764f;
            var_f28 = 0.0f;

            var_r21->x = 0.0f;
            var_r21->z = 0.0f;
            var_r21->y = 1.0f;

            var_r20->x = 0.0f;
            var_r20->y = 0.0f;

            var_r23->r = var_r23->g = var_r23->b = var_r23->a = 0xFF;
            if (var_r29 == 0) {
                var_r30->unk_01 = 1;
                if (var_r29 < 6) {
                    var_r30->unk_08 = (6 - var_r29) / 6.0f;
                }
                else {
                    var_r30->unk_08 = 1.0f;
                }
            }
            else {
                var_r30->unk_01 = 0;
                var_r30->unk_08 = 0.0f;
            }
            if (!var_r25 || var_r25 == 34 || !var_r29) {
                var_r30->unk_00 = 0;
                var_r30->unk_04 = 0.0f;
            }
            else {
                var_r30->unk_00 = 1;
                if (var_r29 < 3) {
                    var_r30->unk_04 = 0.5f + (0.5f * (var_r29 / 3.0f));
                    var_r30->unk_04 = sind(90.0f * var_r30->unk_04);
                }
                else {
                    var_r30->unk_04 = 1.0f;
                }
            }
            var_r30->unk_10.x = var_r24->x;
            var_r30->unk_10.y = var_r24->y;
            var_r30->unk_10.z = var_r24->z;
            var_r30->unk_1C.x = var_r30->unk_1C.y = var_r30->unk_1C.z = 0.0f;
            var_r30->unk_0C = 200.0 * sind(90.0f * (var_r29 / 29.0f));
            if (var_r25 < 6) {
                var_f31 = var_r25 / 6.0f;
                var_r30->unk_04 = var_r30->unk_04 * sind(90.0f * var_f31);
                var_r30->unk_0C = var_r30->unk_0C * sind(90.0f * var_f31);
            }
            else if (var_r25 > 28) {
                var_f31 = (var_r25 - 28) / 6.0f;
                var_r30->unk_04 = var_r30->unk_04 * cosd(90.0f * var_f31);
                var_r30->unk_0C = var_r30->unk_0C * cosd(90.0f * var_f31);
            }
            var_r30->unk_28 = var_r25 / 34.0f;
            var_r30->unk_2C = (var_r29 * 2) / 29.0f;
            if (var_r30->unk_28 > 1.0f) {
                var_r30->unk_28 = fmod(var_r30->unk_28, 1.0);
            }
            if (var_r30->unk_2C > 1.0f) {
                var_r30->unk_2C = fmod(var_r30->unk_2C, 1.0);
            }
            var_r24++;
            var_r21++;
            var_r20++;
            var_r23++;
            var_r30++;
        }
        var_f30 = -500.0f;
        var_f29 += 68.965515f;
    }
    var_r22 = var_r31->unk_9C;
    for (var_r29 = 0; var_r29 < 29; var_r29++) {
        for (var_r25 = 0; var_r25 < 34; var_r22++, var_r25++) {
            (*var_r22)[0] = var_r25 + (var_r29 * 35);
            (*var_r22)[1] = var_r25 + 1 + (var_r29 * 35);
            (*var_r22)[2] = var_r25 + 1 + ((var_r29 + 1) * 35);
            (*var_r22)[3] = var_r25 + ((var_r29 + 1) * 35);
        }
    }
    var_r18 = HuMemDirectMallocNum(HEAP_DATA, 0x10000, var_r26->mallocNo);
    sp10[0] = var_r18;
    DCFlushRange(var_r18, 0x10000);
    GXBeginDisplayList(sp10[0], 0x10000);
    GXBegin(GX_TRIANGLESTRIP, GX_VTXFMT0, 70);
    for (var_r29 = 0; var_r29 < 35; var_r29++) {
        GXPosition1x16(var_r29 + 35);
        GXNormal1x16(var_r29 + 35);
        GXColor1x16(var_r29 + 35);
        GXPosition1x16(var_r29);
        GXNormal1x16(var_r29);
        GXColor1x16(var_r29);
    }
    GXEnd();
    var_r31->unk_A0 = GXEndDisplayList();
    if (var_r31->unk_A0 >= 0x10000) {
        OSReport("ERROR! GList test size over! \n");
    }
    var_r31->unk_A4 = HuMemDirectMallocNum(HEAP_DATA, var_r31->unk_A0, var_r26->mallocNo);
    memcpy(var_r31->unk_A4, var_r18, var_r31->unk_A0);
    DCFlushRange(var_r31->unk_A4, var_r31->unk_A0);
    HuMemDirectFree(var_r18);
    lbl_1_bss_B4 = 70;
    lbl_1_bss_B8 = HuMemDirectMallocNum(HEAP_DATA, lbl_1_bss_B4 * 32, var_r26->mallocNo);
    memset(lbl_1_bss_B8, 0, lbl_1_bss_B4 * 32);
#ifdef NON_MATCHING
    fn_1_64F8(lbl_1_bss_B8, var_f31);
#else
    fn_1_64F8(lbl_1_bss_B8);
#endif
    sp10[1] = &lbl_1_bss_B8[lbl_1_bss_B4 - 1];
    var_r31->unk_18 = sp10[1]->unk_04;
    var_r31->unk_1C = 0.0f;
    var_r31->unk_20 = -1;
    var_r31->unk_24 = 0;
}

