zeranemesis/Marioparty4/partyboard/src/REL/m406Dll/map.c
GXColor lbl_1_data_88F = { 0xFF, 0xFF, 0xFF, 0xFF };
GXColor lbl_1_data_893 = { 0xB3, 0xBB, 0xC2, 0xFF };
GXColor lbl_1_data_897 = { 0xFF, 0xFF, 0xFF, 0xFF };
GXColor lbl_1_data_89B = { 0xFF, 0xFF, 0xFF, 0x40 };
GXColor lbl_1_data_89F = { 0xFF, 0xFF, 0xFF, 0xFF };

float lbl_1_data_8A4[4] = { 1000.0f, 200.0f, 600.0f, 1200.0f };

float lbl_1_data_8B4[4] = { 1.0f, 0.6f, 0.3f, 0.425f };

Vec lbl_1_data_8C4 = { 0.0f, -34700.0f, -62094.0f };

Vec lbl_1_data_8D0 = { 0.0f, 1.0f, 0.0f };

GXColor lbl_1_data_8DC = { 0xFF, 0xFF, 0xFF, 0xFF };

Vec lbl_1_data_8E0[4] = {
    { -0.5f, 0.5f, 0.0f },
    { 0.5f, 0.5f, 0.0f },
    { 0.5f, -0.5f, 0.0f },
    { -0.5f, -0.5f, 0.0f },
};

Vec2f lbl_1_data_910[4] = { { 0.0f, 0.0f }, { 0.25f, 0.0f }, { 0.25f, 0.25f }, { 0.0f, 0.25f } };

Vec lbl_1_data_930[4] = {
    { 0.0f, 0.5f, 0.0f },
    { 0.5f, 0.0f, 0.0f },
    { 0.0f, -0.5f, 0.0f },
    { -0.5f, 0.0f, 0.0f },
};

void fn_1_4084(void)
{
    Vec sp28;
    Vec sp1C;
    Vec sp10;
    void *spC;
    float sp8;

    float var_f31;
    float var_f30;
    float var_f29;
    float var_f28;

    UnkM406Unk120Struct *var_r31;
    s32 var_r30;
    UnkM406Struct *var_r29;
    Vec *var_r28;
    s32 var_r27;
    s32 var_r26;
    HU3DMODEL *var_r25;

    spC = lbl_1_bss_B8;
    var_r25 = &Hu3DData[lbl_1_data_7A4];
    var_r31 = var_r25->hookData;
    if (!var_r31->unk_28) {
        if (++var_r31->unk_24 >= 1 && var_r31->unk_20 == -1) {
            sp28.x = 0.5f * (var_r31->unk_34.x + var_r31->unk_40.x);
            sp28.y = 0.5f * (var_r31->unk_34.y + var_r31->unk_40.y);
            sp28.z = 0.5f * (var_r31->unk_34.z + var_r31->unk_40.z);
            var_r31->unk_20 = HuAudFXEmiterPlay(1337, &sp28);
        }
        else if (var_r31->unk_20 != -1) {
            sp28.x = 0.5f * (var_r31->unk_34.x + var_r31->unk_40.x);
            sp28.y = 0.5f * (var_r31->unk_34.y + var_r31->unk_40.y);
            sp28.z = 0.5f * (var_r31->unk_34.z + var_r31->unk_40.z);
            HuAudFXEmiterUpDate(var_r31->unk_20, &sp28);
        }
    }
    else if (var_r31->unk_20 != -1) {
        HuAudFXStop(var_r31->unk_20);
        var_r31->unk_20 = -1;
    }
    var_r31->unk_0C = var_r31->unk_0C + var_r31->unk_10;
    if (var_r31->unk_0C > var_r31->unk_18) {
        var_r31->unk_1C = var_r31->unk_0C - var_r31->unk_18;
        var_r31->unk_0C = var_r31->unk_18;
    }
    else {
        var_r31->unk_1C = 0.0f;
    }
    var_r28 = var_r31->unk_84;
    var_r29 = var_r31->unk_94;
    var_f30 = 0.0f;
    var_f28 = var_r31->unk_14 / 29.0f;

    for (var_r27 = 0; var_r27 < 30; var_r27++) {
        var_r30 = fn_1_66F4(var_r31->unk_0C - var_f30, &sp8);
        var_f30 += var_f28;
        if (var_r30 < 0) {
            var_r30 = 0;
            sp1C = lbl_1_data_F0[var_r30];
            sp10 = lbl_1_data_438[var_r30];
        }
        else if (var_r30 < (lbl_1_bss_B4 - 1)) {
            fn_1_D488(sp8, &lbl_1_data_F0[var_r30], &lbl_1_data_F0[var_r30 + 1], &sp1C);
            fn_1_D488(sp8, &lbl_1_data_438[var_r30], &lbl_1_data_438[var_r30 + 1], &sp10);
        }
        else {
            var_r30 = lbl_1_bss_B4 - 1;
            sp1C = lbl_1_data_F0[var_r30];
            sp10 = lbl_1_data_438[var_r30];
        }
        if (var_r27 == 0) {
            var_r31->unk_34 = sp1C;
            var_r31->unk_40 = sp10;
            var_r31->unk_7C = var_r30;
            var_f29 = atan2d(var_r31->unk_40.x - var_r31->unk_34.x, var_r31->unk_40.z - var_r31->unk_34.z);
            mtxRot(var_r31->unk_4C, 0.0f, var_f29, 0.0f);
        }
        for (var_r26 = 0, var_f31 = 0.0f; var_r26 < 35; var_r28++, var_r29++, var_r26++) {
            fn_1_D488(var_f31, &sp1C, &sp10, var_r28);
            var_r29->unk_10 = *var_r28;
            var_f31 += 0.029411765f;
            var_r29->unk_1C = lbl_1_bss_B8[var_r30].unk_08;
        }
    }
}

void fn_1_4568(void)
{
    UnkM406Unk120Struct *var_r31;
    HU3DMODEL *var_r30;

    var_r30 = &Hu3DData[lbl_1_data_7A4];
    var_r31 = var_r30->hookData;
    HuMemDirectFree(var_r31->unk_A8);
}

void fn_1_45BC(HU3DMODEL *arg0, Mtx arg1)
{
    Mtx sp10;

    UnkM406Unk120Struct *var_r31;
    s16 var_r30;
    s16 var_r29;
    s16 var_r26;

    var_r31 = arg0->hookData;
    if (!var_r31->unk_08) {
        fn_1_6304(arg0, arg1);
    }
    if (!var_r31->unk_28) {
        GXLoadPosMtxImm(arg1, 0);
        MTXInvXpose(arg1, sp10);
        GXLoadNrmMtxImm(sp10, 0);
        var_r26 = fn_1_D06C(arg0, Hu3DCameraMtx, Hu3DCameraMtxXPose, 2.0f);
        GXSetNumTevStages(1);
        GXSetNumTexGens(0);
        GXSetNumChans(1);
        GXSetTexCoordGen2(GX_TEXCOORD0, GX_TG_MTX2x4, GX_TG_NRM, 0x36, GX_FALSE, 125);
        GXSetTevOrder(GX_TEVSTAGE0, GX_TEXCOORD_NULL, GX_TEXMAP_NULL, GX_COLOR0A0);
        GXSetTevOp(GX_TEVSTAGE0, GX_REPLACE);
        GXSetTevColorIn(GX_TEVSTAGE0, GX_CC_RASC, GX_CC_ZERO, GX_CC_ZERO, GX_CC_ZERO);
        GXSetTevColorOp(GX_TEVSTAGE0, GX_TEV_ADD, GX_TB_ZERO, GX_CS_SCALE_1, GX_TRUE, GX_TEVPREV);
        GXSetTevAlphaIn(GX_TEVSTAGE0, GX_CA_RASA, GX_CA_ZERO, GX_CA_ZERO, GX_CA_ZERO);
        GXSetTevAlphaOp(GX_TEVSTAGE0, GX_TEV_ADD, GX_TB_ZERO, GX_CS_SCALE_1, GX_TRUE, GX_TEVPREV);
        GXSetChanCtrl(GX_COLOR0A0, GX_TRUE, GX_SRC_REG, GX_SRC_REG, var_r26, GX_DF_CLAMP, GX_AF_SPEC);
        GXSetAlphaCompare(GX_GEQUAL, 1, GX_AOP_AND, GX_GEQUAL, 1);
        GXSetZMode(GX_TRUE, GX_LEQUAL, GX_TRUE);
        GXSetZCompLoc(GX_TRUE);
        GXSetBlendMode(GX_BM_BLEND, GX_BL_SRCALPHA, GX_BL_INVSRCALPHA, GX_LO_NOOP);
        GXSetChanAmbColor(GX_COLOR0A0, lbl_1_data_893);
        GXSetChanMatColor(GX_COLOR0A0, lbl_1_data_88F);
        DCFlushRangeNoSync(var_r31->unk_84, var_r31->unk_80 * sizeof(Vec));
        DCFlushRangeNoSync(var_r31->unk_88, var_r31->unk_80 * sizeof(Vec));
        DCFlushRangeNoSync(var_r31->unk_8C, var_r31->unk_80 * sizeof(Vec2f));
        DCFlushRangeNoSync(var_r31->unk_90, var_r31->unk_80 * sizeof(GXColor));
        PPCSync();
        GXClearVtxDesc();
        GXSetVtxDesc(GX_VA_POS, GX_INDEX16);
        GXSetVtxAttrFmt(GX_VTXFMT0, GX_VA_POS, GX_POS_XYZ, GX_F32, 0);
        GXSETARRAY(GX_VA_POS, var_r31->unk_84, var_r31->unk_80 * sizeof(Vec), sizeof(Vec), TRUE);
        GXSetVtxDesc(GX_VA_NRM, GX_INDEX16);
        GXSetVtxAttrFmt(GX_VTXFMT0, GX_VA_NRM, GX_NRM_XYZ, GX_F32, 0);
        GXSETARRAY(GX_VA_NRM, var_r31->unk_88, var_r31->unk_80 * sizeof(Vec), sizeof(Vec), TRUE);
        GXSetVtxDesc(GX_VA_CLR0, GX_INDEX16);
        GXSetVtxAttrFmt(GX_VTXFMT0, GX_VA_CLR0, GX_CLR_RGBA, GX_RGBA8, 0);
        GXSETARRAY(GX_VA_CLR0, var_r31->unk_90, var_r31->unk_80 * sizeof(GXColor), sizeof(GXColor), TRUE);
        GXCallDisplayList(var_r31->unk_A4, var_r31->unk_A0);
        for (var_r30 = 1; var_r30 < 29; var_r30++) {
            var_r29 = var_r30 * 35;
            GXSETARRAY(GX_VA_POS, &var_r31->unk_84[var_r29], 35 * sizeof(Vec), sizeof(Vec), TRUE);
            GXSETARRAY(GX_VA_NRM, &var_r31->unk_88[var_r29], 35 * sizeof(Vec), sizeof(Vec), TRUE);
            GXSETARRAY(GX_VA_CLR0, &var_r31->unk_90[var_r29], 35 * sizeof(GXColor), sizeof(GXColor), TRUE);
            GXCallDisplayList(var_r31->unk_A4, var_r31->unk_A0);
        }
    }
}

void fn_1_4964(HU3DMODEL *arg0)
{
    UnkM406Struct5 spD0;
    Vec spC4;
    Vec spB8;
    Vec spAC;
    Vec spA0;
    Vec2f sp50;
    Vec2f sp48;
    GXColor sp3C;
    float sp38;

    float var_f31;
    float var_f30;
    float var_f29;

    UnkM406Struct4 *var_r31;
    UnkM406Unk120Struct *var_r30;
    UnkM406Struct3 *var_r29;
    UnkM406Struct *var_r28;
    s32 var_r27;
    s32 var_r26;
    Vec *var_r25;
    s32 var_r24;
    s32 var_r23;
    s32 var_r22;
    Vec *var_r21;
    Vec2f *var_r20;
    GXColor *var_r19;

    var_r30 = arg0->hookData;

    if (var_r30->unk_28) {
        if (!omPauseChk()) {
            fn_1_67CC(arg0);
        }
        return;
    }
    if (!omPauseChk()) {
        var_r30->unk_B4 += 0.005f;
        var_r30->unk_B8 += (0.007499999832361937 + (0.001 * var_r30->unk_1C));
        if (fabs(var_r30->unk_B4) > 1.0) { // 1.0 or 1.0f?
            var_r30->unk_B4 = fmod(var_r30->unk_B4, 1.0);
        }
        if (var_r30->unk_B4 < 0.0f) {
            var_r30->unk_B4 += 1.0f;
        }
        if (fabs(var_r30->unk_B8) > 1.0) {
            var_r30->unk_B8 = fmod(var_r30->unk_B8, 1.0);
        }
        if (var_r30->unk_B8 < 0.0f) {
            var_r30->unk_B8 += 1.0f;
        }
        var_r30->unk_C8 += -0.005f;
        var_r30->unk_CC += (-0.007499999832361937 + (0.001 * var_r30->unk_1C));
        if (fabs(var_r30->unk_C8) > 1.0) {
            var_r30->unk_C8 = fmod(var_r30->unk_C8, 1.0);
        }
        if (var_r30->unk_C8 < 0.0f) {
            var_r30->unk_C8 += 1.0f;
        }
        if (fabs(var_r30->unk_CC) > 1.0) {
            var_r30->unk_CC = fmod(var_r30->unk_CC, 1.0);
        }
        if (var_r30->unk_CC < 0.0f) {
            var_r30->unk_CC += 1.0f;
        }
    }
    var_r25 = var_r30->unk_84;
    var_r21 = var_r30->unk_88;
    var_r20 = var_r30->unk_8C;
    var_r19 = var_r30->unk_90;
    var_r28 = var_r30->unk_94;
    sp50.x = var_r30->unk_AC - 1;
    sp50.y = var_r30->unk_B0 - 1;
    sp48.x = var_r30->unk_C0 - 1;
    sp48.y = var_r30->unk_C4 - 1;
    for (var_r27 = 0; var_r27 < var_r30->unk_80; var_r27++) {
        *var_r25 = var_r28->unk_10;
        if (var_r28->unk_00 || var_r28->unk_01) {
            var_r23 = (s32)(sp50.x * (var_r28->unk_28 + var_r30->unk_B4)) & 0x7F;
            var_r22 = (s32)(sp50.y * (var_r28->unk_2C + var_r30->unk_B8)) & 0x7F;
            var_f31 = var_r30->unk_A8[(var_r22 * var_r30->unk_AC) + var_r23];
            var_r23 = (s32)(sp48.x * (var_r28->unk_28 + var_r30->unk_C8)) & 0x7F;
            var_r22 = (s32)(sp48.y * (var_r28->unk_2C + var_r30->unk_CC)) & 0x7F;
            var_f31 += var_r30->unk_BC[(var_r22 * var_r30->unk_C0) + var_r23];
            if (var_r28->unk_00) {
                var_r25->y = var_r28->unk_10.y + var_r28->unk_0C + (100.0f * (0.003921569f * (var_r28->unk_04 * var_f31)));
            }
            if (var_r28->unk_01) {
                var_r25->z = var_r28->unk_10.z - (50.0f * (0.003921569f * (var_r28->unk_08 * var_f31)));
            }
            (void)var_f31;
            (void)var_f31;
            (void)var_f31;
            (void)var_f31;
        }
        var_r25++;
        var_r21++;
        var_r20++;
        var_r19++;
        var_r28++;
    }
    if (omPauseChk()) {
        return;
    }
    for (var_r27 = 0; var_r27 < 5; var_r27++) {
        var_r26 = (u32)frand() % 34;
        fn_1_D488(0.007874016f * (frand() & 0x7F), &var_r30->unk_84[var_r26], &var_r30->unk_84[var_r26 + 1], &spC4);
        spC4.x += 10.0f * var_r30->unk_94->unk_1C.x;
        spC4.z += 10.0f * var_r30->unk_94->unk_1C.z;
        spA0.y = 5.0f + (5.0f * (0.007874016f * (frand() & 0x7F)));
        spA0.x = spA0.z = 0.0f;
        var_r26 = (frand() & 0x1F) + 0xE0;
        sp3C.r = 0.96f * var_r26;
        sp3C.g = 0.98f * var_r26;
        sp3C.b = (float)var_r26;
        sp3C.a = 0xC8;
        fn_1_71C4(spC4, spA0, 100.0f + (50.0f * (0.007874016f * (frand() & 0x7F))), -0.1f, sp3C);
    }
    var_r29 = var_r30->unk_2C;
#if defined(NON_MATCHING)
    memset(&lbl_1_bss_48, 0, sizeof(UnkM406Struct5));
#else
    memset(lbl_1_bss_48, 0, sizeof(UnkM406Struct5));
#endif
    for (var_r27 = 0; var_r27 < 105; var_r27++, var_r29++) {
        fn_1_D488(var_r29->unk_04, &var_r30->unk_84[var_r29->unk_00], &var_r30->unk_84[var_r29->unk_00 + 1], &var_r29->unk_18);
        if (var_r29->unk_08 >= 0) {
            var_r29->unk_08--;
        }
        else {
            var_r29->unk_24 = fn_1_7B2C(var_r29->unk_0C);
            if (var_r29->unk_24 == NULL) {
                var_r29->unk_24 = &lbl_1_bss_48;
            }
            if (var_r29->unk_24->unk_28 <= 0.0f) {
                spC4 = var_r29->unk_18;
                spA0.x = spA0.y = spA0.z = 0.0f;
                var_r26 = (frand() & 0x1F) + 0xE0;
                sp3C.r = 0.96f * var_r26;
                sp3C.g = 0.98f * var_r26;
                sp3C.b = 1.0f * var_r26;
                sp3C.a = 0xFF;
                if (frand() & 1) {
                    var_f31 = 0.05f;
                }
                else {
                    var_f31 = -0.05f;
                }
                var_r29->unk_10 = 0.01f * (100.0f * (0.007874016f * (frand() & 0x7F)));
                var_r29->unk_0C = fn_1_79F8(spC4, spA0, 75.0f + (var_r29->unk_14 * (75.0f * (0.007874016f * (frand() & 0x7F)))), var_f31, sp3C);
            }
            else {
                var_r29->unk_18.y += var_r29->unk_10;
                var_r29->unk_24->unk_30 = var_r29->unk_18;
            }
        }
    }
    sp3C.r = sp3C.g = sp3C.b = sp3C.a = 0xFF;
    fn_1_D488(0.007874016f * (frand() & 0x7F), &var_r30->unk_84[0], &var_r30->unk_84[34], &spC4);
    if ((frand() & 3) == 0) {
        var_f31 = 45.0f + (30.0f * (0.007874016f * (frand() & 0x7F)));
        var_f29 = 0.75f + (0.75f * (0.007874016f * (frand() & 0x7F)));
    }
    else {
        var_f31 = -(15.0f * (0.007874016f * (frand() & 0x7F)));
        var_f29 = 1.75f + (0.75f * (0.007874016f * (frand() & 0x7F)));
    }
    if (var_r30->unk_10 != 0.0f) {
        var_f30 = 15.000001f / var_r30->unk_10;
    }
    else {
        var_f30 = 1.0f;
    }
    spA0.y = var_f30 * ((7.5000005f * var_f29) * sind(var_f31));
    var_f30 = (0.75f * var_r30->unk_10) + (7.5000005f * var_f29) * cosd(var_f31);
    var_f30 = var_f30;
    spA0.x = var_r30->unk_94->unk_1C.x * var_f30;
    spA0.z = var_r30->unk_94->unk_1C.z * var_f30;

    fn_1_7DB0(spC4, spA0, 7.5f, sp3C);
    var_r31 = var_r30->unk_30;
    for (var_r27 = 0; var_r27 < 12; var_r27++, var_r31++) {
        if (var_r31->unk_08 == 0) {
            if (var_r31->unk_0C <= 0) {
                var_f30 = 0.5f + (0.75f * (0.007874016f * (frand() & 0x7F)));
                Hu3DModelScaleSet(var_r31->unk_00, var_f30, var_f30, var_f30);
                var_r31->unk_04 = frand() & 1;
                switch (var_r31->unk_04) {
                    case 0:
                        var_r31->unk_10 = 0.1f + (0.8f * (0.007874016f * (frand() & 0x7F)));
                        var_r31->unk_14 = var_r31->unk_18 = 0.0f;
                        var_r31->unk_20 = var_r31->unk_24 = 0.0f;
                        var_r31->unk_08 = 0;
                        var_r31->unk_0C = 0;
                        var_r31->unk_1C = 100.0f * (0.5f + (0.75f * (0.007874016f * (frand() & 0x7F))));
                        var_r31->unk_28 = 0.0f;
                        var_r31->unk_2C = 15.0f + (15.0f * (0.007874016f * (frand() & 0x7F)));
                        break;
                    case 1:
                        var_r31->unk_10 = 0.1f + (0.8f * (0.007874016f * (frand() & 0x7F)));
                        var_r31->unk_14 = var_r31->unk_18 = 0.0f;
                        var_r31->unk_20 = var_r31->unk_24 = 0.0f;
                        var_r31->unk_08 = 0;
                        var_r31->unk_0C = 0;
                        var_r31->unk_1C = 100.0f * (0.5f + (0.007874016f * (frand() & 0x7F)));
                        var_r31->unk_28 = 100.0f * (0.07f + (0.03f * (0.007874016f * (frand() & 0x7F))));
                        var_r31->unk_2C = 15.0f + (15.0f * (0.007874016f * (frand() & 0x7F)));
                        break;
                    default:
                        break;
                }
            }
            else {
                Hu3DModelAttrSet(var_r31->unk_00, HU3D_ATTR_DISPOFF);
                var_r31->unk_08 = -1;
                var_r31->unk_0C--;
            }
        }
        else if (var_r31->unk_08 >= 0) {
            var_r24 = fn_1_66F4(var_r30->unk_0C + var_r31->unk_18, &sp38);
            if (var_r24 >= 0 && var_r24 < (lbl_1_bss_B4 - 1)) {
                fn_1_D488(sp38, &lbl_1_data_F0[var_r24], &lbl_1_data_F0[var_r24 + 1], &spB8);
                fn_1_D488(sp38, &lbl_1_data_438[var_r24], &lbl_1_data_438[var_r24 + 1], &spAC);
                fn_1_D488(var_r31->unk_10, &spB8, &spAC, &var_r31->unk_3C);
                Hu3DModelAttrReset(var_r31->unk_00, HU3D_ATTR_DISPOFF);
            }
            else {
                Hu3DModelAttrSet(var_r31->unk_00, HU3D_ATTR_DISPOFF);
                var_r31->unk_08 = -1;
                continue;
            }

