zeranemesis/Marioparty4/partyboard/src/REL/m406Dll/map.c
            switch (var_r31->unk_04) {
                case 0:
                    var_r31->unk_18 = var_r31->unk_1C * sind(5.0f * var_r31->unk_08);
                    var_r31->unk_20 = var_r31->unk_20 - var_r31->unk_2C;
                    Hu3DModelPosSet(var_r31->unk_00, var_r31->unk_3C.x, var_r31->unk_3C.y, var_r31->unk_3C.z);
                    Hu3DModelRotSet(var_r31->unk_00, var_r31->unk_20, var_r31->unk_24, 0.0f);
                    break;
                case 1:
                    var_r31->unk_18 = var_r31->unk_1C * sind((float)var_r31->unk_08);
                    var_r31->unk_20 = var_r31->unk_20 - var_r31->unk_2C;
                    var_r31->unk_14 = var_r31->unk_14 + var_r31->unk_28;
                    if (var_r31->unk_14 < 0.0f) {
                        var_f30 = 0.65 + (0.15 * (0.007874016f * (frand() & 0x7F)));
                        var_f30 = var_f30;
                        var_r31->unk_14 = 0.0f;
                        var_r31->unk_28 = var_r31->unk_28 * -var_f30;
                    }
                    var_r31->unk_28 = var_r31->unk_28 - 0.32666668f;
                    var_r31->unk_3C.y += var_r31->unk_14;
                    Hu3DModelPosSet(var_r31->unk_00, var_r31->unk_3C.x, var_r31->unk_3C.y, var_r31->unk_3C.z);
                    Hu3DModelRotSet(var_r31->unk_00, var_r31->unk_20, var_r31->unk_24, 0.0f);
                    break;
                default:
                    break;
            }
        }
        if (var_r31->unk_18 < (-0.1f * var_r31->unk_1C)) {
            var_r31->unk_08 = -1;
            var_r31->unk_0C = frand() & 0x1F;
        }
        var_r31->unk_08++;
    }
    var_r30->unk_00++;
}

void fn_1_6174(HU3DMODEL *arg0)
{
    Vec sp20;
    Vec sp14;
    Vec sp8;

    UnkM406Unk120Struct *var_r31;
    s16(*var_r30)[4];
    s32 var_r29;
    Vec *var_r28;

    var_r31 = arg0->hookData;
    memset(var_r31->unk_88, 0, var_r31->unk_80 * sizeof(Vec));
    for (var_r29 = 0, var_r30 = var_r31->unk_9C; var_r29 < var_r31->unk_98; var_r29++, var_r30++) {
        VECSubtract(&var_r31->unk_84[(*var_r30)[1]], &var_r31->unk_84[(*var_r30)[0]], &sp14);
        VECSubtract(&var_r31->unk_84[(*var_r30)[2]], &var_r31->unk_84[(*var_r30)[1]], &sp8);
        VECCrossProduct(&sp14, &sp8, &sp20);

        VECAdd(&var_r31->unk_88[(*var_r30)[0]], &sp20, &var_r31->unk_88[(*var_r30)[0]]);
        VECAdd(&var_r31->unk_88[(*var_r30)[1]], &sp20, &var_r31->unk_88[(*var_r30)[1]]);
        VECAdd(&var_r31->unk_88[(*var_r30)[2]], &sp20, &var_r31->unk_88[(*var_r30)[2]]);
        VECAdd(&var_r31->unk_88[(*var_r30)[3]], &sp20, &var_r31->unk_88[(*var_r30)[3]]);
    }
    for (var_r29 = 0, var_r28 = var_r31->unk_88; var_r29 < var_r31->unk_80; var_r29++) {
        VECNormalize(var_r28, var_r28);
    }
}

void fn_1_6304(HU3DMODEL *arg0, Mtx arg1)
{
    UnkM406Unk120Struct *var_r28;
    HU3DMODEL *var_r27;
    s32 simulationTicks;
    s32 tick;

    var_r28 = arg0->hookData;
    var_r27 = &Hu3DData[var_r28->unk_04];
#ifdef TARGET_PC
    simulationTicks = PartyBoard_SimulationTicksThisFrame;
    /* The hook can be reached once by the terrain draw and again by its own
     * layer model in the same presentation.  GlobalCounter identifies that
     * presentation's simulation state and prevents a double advance. */
    if (m406LastEffectSimulationCounter == GlobalCounter) {
        simulationTicks = 0;
    } else if (simulationTicks > 0) {
        m406LastEffectSimulationCounter = GlobalCounter;
    }
#else
    simulationTicks = 1;
#endif
    for (tick = 0; tick < simulationTicks; ++tick) {
        if (!omPauseChk() && lbl_1_bss_30[0]) {
            fn_1_4084();
            fn_1_6FFC();
            fn_1_77F0();
            fn_1_7C4C();
            fn_1_7F80();
            fn_1_91E0();
        }
        fn_1_4964(var_r27);
    }
    if (simulationTicks > 0) {
        fn_1_6174(var_r27);
    }
    var_r28->unk_08 = 1;
}

#ifdef NON_MATCHING
void fn_1_64F8(UnkM406Struct2 *arg0, float var_f31)
{
#else
void fn_1_64F8(UnkM406Struct2 *arg0)
{
    float var_f31; // ! - uninitialized
#endif

    UnkM406Struct2 *var_r31;
    s32 var_r30;
    UnkM406Struct2 *var_r28;

    for (var_r30 = 0, var_r31 = arg0; var_r30 < lbl_1_bss_B4; var_r30++, var_r31++) {
        var_r31->unk_14.x = 0.5f * (lbl_1_data_F0[var_r30].x + lbl_1_data_438[var_r30].x);
        var_r31->unk_14.y = 0.5f * (lbl_1_data_F0[var_r30].y + lbl_1_data_438[var_r30].y);
        var_r31->unk_14.z = 0.5f * (lbl_1_data_F0[var_r30].z + lbl_1_data_438[var_r30].z);
    }
    for (var_r30 = 0, var_r31 = arg0; var_r30 < lbl_1_bss_B4; var_r30++, var_r31++) {
        if (var_r30 < lbl_1_bss_B4 - 1) {
            var_r28 = &arg0[var_r30 + 1];
            VECSubtract(&var_r28->unk_14, &var_r31->unk_14, &var_r31->unk_08);
            var_r31->unk_00 = VECMag(&var_r31->unk_08);
            VECNormalize(&var_r31->unk_08, &var_r31->unk_08);
        }
        else {
            var_r31->unk_00 = 100000.0f;
            var_r31->unk_08.x = 0.0f;
            var_r31->unk_08.y = 0.0f;
            var_r31->unk_08.z = -1.0f;
        }
        var_r31->unk_04 = var_f31;
        var_f31 += var_r31->unk_00;
    }
}

s32 fn_1_66F4(float arg8, float *arg0)
{
    UnkM406Struct2 *var_r31;
    s32 var_r30;

    for (var_r30 = 0, var_r31 = lbl_1_bss_B8; var_r30 < lbl_1_bss_B4; var_r30++, var_r31++) {
        if (arg8 < (var_r31->unk_04 + var_r31->unk_00)) {
            *arg0 = (arg8 - var_r31->unk_04) / var_r31->unk_00;
            if (*arg0 < 0.0f) {
                *arg0 = 0.0f;
            }
            break;
        }
    }
    if (var_r30 >= lbl_1_bss_B4) {
        if (arg0) {
            *arg0 = 0.0f;
        }
        return -1;
    }
    return var_r30;
}

void fn_1_67CC(HU3DMODEL *arg0)
{
    UnkM406Struct4 *var_r31;
    s32 var_r30;
    UnkM406Unk120Struct *var_r29;

    var_r29 = arg0->hookData;
    var_r31 = var_r29->unk_30;
    for (var_r30 = 0; var_r30 < 12; var_r30++, var_r31++) {
        if (var_r31->unk_04 != 3 || var_r31->unk_0C > 0) {
            Hu3DModelAttrSet(var_r31->unk_00, HU3D_ATTR_DISPOFF);
            var_r31->unk_0C--;
        }
        else {
            var_r31->unk_20 = var_r31->unk_20 - var_r31->unk_2C;
            var_r31->unk_3C.x += var_r31->unk_30.x;
            var_r31->unk_3C.y += var_r31->unk_30.y;
            var_r31->unk_3C.z += var_r31->unk_30.z;
            var_r31->unk_30.y -= 0.49f;
            Hu3DModelPosSet(var_r31->unk_00, var_r31->unk_3C.x, var_r31->unk_3C.y, var_r31->unk_3C.z);
            Hu3DModelRotSet(var_r31->unk_00, var_r31->unk_20, var_r31->unk_24, 0.0f);
            Hu3DModelAttrReset(var_r31->unk_00, HU3D_ATTR_DISPOFF);
            if (++var_r31->unk_08 >= (REFRESH_RATE * 10.0f)) {
                Hu3DModelAttrSet(var_r31->unk_00, HU3D_ATTR_DISPOFF);
                var_r31->unk_04 = 0;
                var_r31->unk_08 = 0;
            }
        }
    }
}

void fn_1_696C(float arg8)
{
    UnkM406Unk120Struct *var_r31;
    HU3DMODEL *var_r30;

    if (lbl_1_data_7A4 >= 0) {
        var_r30 = &Hu3DData[lbl_1_data_7A4];
        var_r31 = var_r30->hookData;
        var_r31->unk_10 = arg8;
    }
}

void fn_1_69C0(Vec *arg0)
{
    UnkM406Unk120Struct *var_r31;
    HU3DMODEL *var_r30;

    arg0->x = arg0->y = arg0->z = 0.0f;
    if (lbl_1_data_7A4 >= 0) {
        var_r30 = &Hu3DData[lbl_1_data_7A4];
        var_r31 = var_r30->hookData;
        *arg0 = var_r31->unk_94[17].unk_10;
    }
}

s32 fn_1_6A44(Vec arg0)
{
    Vec sp20;
    Vec sp14;
    Vec sp8;

    float var_f31;

    UnkM406Unk120Struct *var_r31;
    HU3DMODEL *var_r29;

    if (lbl_1_data_7A4 < 0) {
        return 0;
    }
    var_r29 = &Hu3DData[lbl_1_data_7A4];
    var_r31 = var_r29->hookData;
    VECAdd(&var_r31->unk_34, &var_r31->unk_40, &sp8);
    VECScale(&sp8, &sp8, 0.5f);
    VECSubtract(&var_r31->unk_34, &sp8, &sp20);
    VECSubtract(&var_r31->unk_40, &sp8, &sp14);
    var_f31 = fn_1_D5CC(&sp20, &sp14, arg0.x - sp8.x, arg0.z - sp8.z);
    if (var_f31 <= 0.0f) {
        return 0;
    }
    return 1;
}

