zeranemesis/Marioparty4/partyboard/src/REL/m406Dll/map.c
void fn_1_6B5C(void)
{
    UnkM406Unk120Struct *var_r31;
    HU3DMODEL *var_r30;

    if (lbl_1_data_7A4 >= 0) {
        var_r30 = &Hu3DData[lbl_1_data_7A4];
        var_r31 = var_r30->hookData;
        var_r31->unk_28 = 1;
    }
}

void fn_1_6BB4(Vec *arg0)
{
    Vec sp30;
    Vec sp24;

    float var_f31;

    s32 var_r30;
    s32 var_r29;

    for (var_r30 = 0; var_r30 < 32; var_r30++) {
        sp30.x = arg0->x + (100.0f * ((0.007874016f * (frand() & 0x7F)) - 0.5f));
        sp30.y = arg0->y;
        sp30.z = arg0->z - 100.0f;
        sp24.x = 2.0f * (0.5f - (0.007874016f * (frand() & 0x7F)));
        sp24.z = -2.0f * (1.0f + (1.2f * (0.007874016f * (frand() & 0x7F))));
        sp24.y = 7.5000005f * (1.0f + (0.7f * (0.007874016f * (frand() & 0x7F))));
        var_f31 = 5.5f + (5.5f * (0.007874016f * (frand() & 0x7F)));

        var_r29 = fn_1_8104(sp30, sp24, var_f31, lbl_1_data_897);
        fn_1_8244(var_r29, (s32)(60.0f * (0.007874016f * (frand() & 0x7F))) + 60, 0.32666668f, 0.99f);
    }
}

void fn_1_6F24(void)
{
    s32 sp8;

    UnkM406Struct10 *var_r31;
    UnkM406Unk120Struct2 *var_r30;
    HU3DMODEL *var_r29;
    ANIMDATA *var_r28;

    var_r31 = lbl_1_bss_B0 = HuMemDirectMallocNum(HEAP_SYSTEM, sizeof(UnkM406Struct10), MEMORY_DEFAULT_NUM);
    memset(var_r31, 0, sizeof(UnkM406Struct10));
    var_r28 = HuSprAnimRead(HuDataReadNum(DATA_MAKE_NUM(DATADIR_M406, 63), MEMORY_DEFAULT_NUM));
    var_r31->unk_08 = var_r28;
    var_r31->unk_00 = sp8 = fn_1_B474(var_r28, 0x800);
    Hu3DModelLayerSet(var_r31->unk_00, 2);
    var_r31->unk_04 = 0;
    var_r29 = &Hu3DData[var_r31->unk_00];
    var_r30 = var_r29->hookData;
    var_r30->unk_20 = 0;
}

void fn_1_6FFC(void)
{
    UnkM406Struct5 *var_r31;
    UnkM406Struct10 *var_r30;
    UnkM406Unk120Struct2 *var_r29;
    s32 var_r28;
    HU3DMODEL *var_r27;

    var_r30 = lbl_1_bss_B0;
    if (var_r30->unk_04 <= 0) {
        Hu3DModelAttrSet(var_r30->unk_00, HU3D_ATTR_DISPOFF);
        return;
    }
    Hu3DModelAttrReset(var_r30->unk_00, HU3D_ATTR_DISPOFF);
    var_r27 = &Hu3DData[var_r30->unk_00];
    var_r29 = var_r27->hookData;
    var_r31 = var_r29->unk_3C;
    for (var_r28 = 0; var_r28 < var_r29->unk_26; var_r28++, var_r31++) {
        if (var_r31->unk_28 <= 0.0f) {
            continue;
        }
        var_r31->unk_30.x += var_r31->unk_04.x;
        var_r31->unk_30.y += var_r31->unk_04.y;
        var_r31->unk_30.z += var_r31->unk_04.z;
        var_r31->unk_2C += var_r31->unk_18;
        if (var_r31->unk_2C >= 360.0f) {
            var_r31->unk_2C -= 360.0f;
        }
        var_r31->unk_40 = var_r31->unk_00 >> 1;
        var_r31->unk_00++;
        if (var_r31->unk_40 >= 16) {
            var_r31->unk_40 = 0;
            var_r31->unk_00 = 0;
            var_r31->unk_28 = 0.0f;
            var_r30->unk_04--;
        }
    }
}

void fn_1_717C(void)
{
    UnkM406Struct10 *var_r31;

    var_r31 = lbl_1_bss_B0;
    Hu3DModelAttrSet(var_r31->unk_00, HU3D_ATTR_DISPOFF);
    HuSprAnimKill(var_r31->unk_08);
}

s32 fn_1_71C4(Vec arg0, Vec arg1, float arg8, float arg9, GXColor arg2)
{
    UnkM406Struct5 *var_r31;
    UnkM406Unk120Struct2 *var_r30;
    s32 var_r29;
    UnkM406Struct10 *var_r28;
    HU3DMODEL *var_r27;

    var_r28 = lbl_1_bss_B0;
    var_r27 = &Hu3DData[var_r28->unk_00];
    var_r30 = var_r27->hookData;
    var_r31 = var_r30->unk_3C;
    for (var_r29 = 0; var_r29 < var_r30->unk_26; var_r29++, var_r31++) {
        if (var_r31->unk_28 <= 0.0f) {
            break;
        }
    }
    if (var_r29 >= var_r30->unk_26) {
        return -1;
    }
    var_r31->unk_00 = var_r31->unk_02 = 0;

    var_r31->unk_30.x = arg0.x;
    var_r31->unk_30.y = arg0.y;
    var_r31->unk_30.z = arg0.z;

    var_r31->unk_04.x = arg1.x;
    var_r31->unk_04.y = arg1.y;
    var_r31->unk_04.z = arg1.z;

    var_r31->unk_18 = arg9;
    var_r31->unk_28 = arg8;

    var_r31->unk_3C.r = arg2.r;
    var_r31->unk_3C.g = arg2.g;
    var_r31->unk_3C.b = arg2.b;
    var_r31->unk_3C.a = arg2.a;

    var_r31->unk_2C = 0.0f;
    var_r31->unk_40 = 0;
    var_r31->unk_00 = 0;
    var_r28->unk_04++;

    return var_r29;
}

// TODO maybe pass struct by value
s32 fn_1_72F8(Vec *arg0, Vec *arg1, GXColor *arg2, float arg8, float arg9, float argA)
{
    Vec sp54;
    Vec sp48;
    s32 sp14;
    s32 sp10;

    float var_f31;

    sp48.x = arg1->z;
    sp48.z = arg1->x;
    sp48.y = 0.0f;

    var_f31 = 0.5f * argA;

    sp54.x = arg0->x + (sp48.x * var_f31);
    sp54.y = arg0->y + (sp48.y * var_f31);
    sp54.z = arg0->z + (sp48.z * var_f31);
    sp14 = fn_1_71C4(sp54, *arg1, arg8, arg9, *arg2);

    sp54.x = arg0->x - (sp48.x * var_f31);
    sp54.y = arg0->y - (sp48.y * var_f31);
    sp54.z = arg0->z - (sp48.z * var_f31);

    sp10 = fn_1_71C4(sp54, *arg1, arg8, -arg9, *arg2);
    return (sp14 << 16) | sp10;
}

UnkM406Struct5 *fn_1_76A8(s32 arg0)
{
    UnkM406Unk120Struct2 *var_r31;
    UnkM406Struct10 *var_r30;
    HU3DMODEL *var_r29;

    var_r30 = lbl_1_bss_B0;
    var_r29 = &Hu3DData[var_r30->unk_00];
    var_r31 = var_r29->hookData;
    if (arg0 < 0 || arg0 >= var_r31->unk_26) {
        return 0;
    }
    return &var_r31->unk_3C[arg0];
}

void fn_1_7718(void)
{
    s32 sp8;

    UnkM406Struct10 *var_r31;
    UnkM406Unk120Struct2 *var_r30;
    HU3DMODEL *var_r29;
    ANIMDATA *var_r28;

    var_r31 = lbl_1_bss_AC = HuMemDirectMallocNum(HEAP_SYSTEM, sizeof(UnkM406Struct10), MEMORY_DEFAULT_NUM);
    memset(var_r31, 0, sizeof(UnkM406Struct10));
    var_r28 = HuSprAnimRead(HuDataReadNum(DATA_MAKE_NUM(DATADIR_M406, 63), MEMORY_DEFAULT_NUM));
    var_r31->unk_08 = var_r28;
    var_r31->unk_00 = sp8 = fn_1_B474(var_r28, 105);
    Hu3DModelLayerSet(var_r31->unk_00, 2);
    var_r31->unk_04 = 0;
    var_r29 = &Hu3DData[var_r31->unk_00];
    var_r30 = var_r29->hookData;
    var_r30->unk_20 = 0;
}

void fn_1_77F0(void)
{
    UnkM406Struct5 *var_r31;
    UnkM406Struct10 *var_r30;
    UnkM406Unk120Struct2 *var_r29;
    s32 var_r28;
    HU3DMODEL *var_r27;

    var_r30 = lbl_1_bss_AC;
    if (var_r30->unk_04 <= 0) {
        Hu3DModelAttrSet(var_r30->unk_00, HU3D_ATTR_DISPOFF);
        return;
    }
    Hu3DModelAttrReset(var_r30->unk_00, HU3D_ATTR_DISPOFF);
    var_r27 = &Hu3DData[var_r30->unk_00];
    var_r29 = var_r27->hookData;
    var_r31 = var_r29->unk_3C;
    if (fn_1_122C() < 3) {
        var_r29->unk_22 |= 1;
    }
    else {
        var_r29->unk_22 &= 0xFFFFFFFE;
    }
    for (var_r28 = 0; var_r28 < var_r29->unk_26; var_r28++, var_r31++) {
        if (var_r31->unk_28 <= 0.0f) {
            continue;
        }
        var_r31->unk_30.x += var_r31->unk_04.x;
        var_r31->unk_30.y += var_r31->unk_04.y;
        var_r31->unk_30.z += var_r31->unk_04.z;
        var_r31->unk_2C += var_r31->unk_18;
        if (var_r31->unk_2C >= 360.0f) {
            var_r31->unk_2C = var_r31->unk_2C - 360.0f;
        }
        var_r31->unk_40 = var_r31->unk_00 / 2;
        var_r31->unk_00++;
        if (var_r31->unk_40 >= 0x10) {
            var_r31->unk_40 = 0;
            var_r31->unk_00 = 0;
            var_r31->unk_02 = 0;
            var_r31->unk_28 = 0.0f;
            var_r30->unk_04--;
        }
    }
}

void fn_1_79B0(void)
{
    UnkM406Struct10 *var_r31;

    var_r31 = lbl_1_bss_AC;
    Hu3DModelAttrSet(var_r31->unk_00, HU3D_ATTR_DISPOFF);
    HuSprAnimKill(var_r31->unk_08);
}

s32 fn_1_79F8(Vec arg0, Vec arg1, float arg8, float arg9, GXColor arg2)
{
    UnkM406Struct5 *var_r31;
    UnkM406Unk120Struct2 *var_r30;
    s32 var_r29;
    UnkM406Struct10 *var_r28;
    HU3DMODEL *var_r27;

    var_r28 = lbl_1_bss_AC;
    var_r27 = &Hu3DData[var_r28->unk_00];
    var_r30 = var_r27->hookData;
    var_r31 = var_r30->unk_3C;
    for (var_r29 = 0; var_r29 < var_r30->unk_26; var_r29++, var_r31++) {
        if (var_r31->unk_28 <= 0.0f) {
            break;
        }
    }
    if (var_r29 >= var_r30->unk_26) {
        return -1;
    }
    var_r31->unk_00 = var_r31->unk_02 = 0;

    var_r31->unk_30.x = arg0.x;
    var_r31->unk_30.y = arg0.y;
    var_r31->unk_30.z = arg0.z;

    var_r31->unk_04.x = arg1.x;
    var_r31->unk_04.y = arg1.y;
    var_r31->unk_04.z = arg1.z;

