zeranemesis/Marioparty4/partyboard/src/REL/m406Dll/map.c
    var_r31->unk_18 = arg9;
    var_r31->unk_28 = arg8;

    var_r31->unk_3C.r = arg2.r;
    var_r31->unk_3C.g = arg2.g;
    var_r31->unk_3C.b = arg2.b;
    var_r31->unk_3C.a = arg2.a;

    var_r31->unk_2C = 0.0f;
    var_r31->unk_40 = 0;
    var_r31->unk_00 = 0;
    var_r28->unk_04++;

    return var_r29;
}

UnkM406Struct5 *fn_1_7B2C(s32 arg0)
{
    UnkM406Unk120Struct2 *var_r31;
    UnkM406Struct10 *var_r30;
    HU3DMODEL *var_r29;

    var_r30 = lbl_1_bss_AC;
    var_r29 = &Hu3DData[var_r30->unk_00];
    var_r31 = var_r29->hookData;
    if (arg0 < 0 || arg0 >= var_r31->unk_26) {
        return NULL;
    }
    return &var_r31->unk_3C[arg0];
}

void fn_1_7B9C(void)
{
    s32 sp8;

    UnkM406Struct6 *var_r31;
    UnkM406Unk120Struct2 *var_r30;
    HU3DMODEL *var_r29;

    var_r31 = lbl_1_bss_A8 = HuMemDirectMallocNum(HEAP_SYSTEM, sizeof(UnkM406Struct6), MEMORY_DEFAULT_NUM);
    memset(var_r31, 0, sizeof(UnkM406Struct6));
    var_r31->unk_00 = sp8 = fn_1_C4F4(512);
    Hu3DModelLayerSet(var_r31->unk_00, 3);
    var_r31->unk_04 = 0;
    var_r29 = &Hu3DData[var_r31->unk_00];
    var_r30 = var_r29->hookData;
    var_r30->unk_20 = 0;
}

void fn_1_7C4C(void)
{
    UnkM406Struct5 *var_r31;
    UnkM406Struct6 *var_r30;
    UnkM406Unk120Struct2 *var_r29;
    s32 var_r28;
    HU3DMODEL *var_r27;

    var_r30 = lbl_1_bss_A8;
    if (var_r30->unk_04 <= 0) {
        Hu3DModelAttrSet(var_r30->unk_00, HU3D_ATTR_DISPOFF);
        return;
    }
    Hu3DModelAttrReset(var_r30->unk_00, HU3D_ATTR_DISPOFF);
    var_r27 = &Hu3DData[var_r30->unk_00];
    var_r29 = var_r27->hookData;
    var_r31 = var_r29->unk_3C;
    for (var_r28 = 0; var_r28 < var_r29->unk_26; var_r28++, var_r31++) {
        if (var_r31->unk_28 <= 0.0f) {
            continue;
        }
        var_r31->unk_30.x += var_r31->unk_04.x;
        var_r31->unk_30.y += var_r31->unk_04.y;
        var_r31->unk_30.z += var_r31->unk_04.z;
        var_r31->unk_04.y -= 0.32666668f;
        if (++var_r31->unk_00 > 60 || var_r31->unk_30.y < var_r31->unk_14 - 200.0f) {
            var_r31->unk_00 = 0;
            var_r31->unk_28 = 0.0f;
            var_r30->unk_04--;
        }
    }
}

void fn_1_7DAC(void) { }

s32 fn_1_7DB0(Vec arg0, Vec arg1, float arg8, GXColor arg2)
{
    UnkM406Struct5 *var_r31;
    UnkM406Unk120Struct2 *var_r30;
    s32 var_r29;
    UnkM406Struct6 *var_r28;
    HU3DMODEL *var_r27;

    var_r28 = lbl_1_bss_A8;
    var_r27 = &Hu3DData[var_r28->unk_00];
    var_r30 = var_r27->hookData;
    var_r31 = var_r30->unk_3C;
    for (var_r29 = 0; var_r29 < var_r30->unk_26; var_r29++, var_r31++) {
        if (var_r31->unk_28 <= 0.0f) {
            break;
        }
    }
    if (var_r29 >= var_r30->unk_26) {
        return -1;
    }
    var_r31->unk_00 = var_r31->unk_02 = 0;

    var_r31->unk_30.x = arg0.x;
    var_r31->unk_30.y = arg0.y;
    var_r31->unk_30.z = arg0.z;

    var_r31->unk_04.x = arg1.x;
    var_r31->unk_04.y = arg1.y;
    var_r31->unk_04.z = arg1.z;

    var_r31->unk_14 = arg0.y;
    var_r31->unk_28 = arg8;
    var_r31->unk_3C = arg2;
    var_r31->unk_00 = 0;
    var_r28->unk_04++;

    return var_r29;
}

void fn_1_7ED0(void)
{
    s32 sp8;

    UnkM406Struct6 *var_r31;
    UnkM406Unk120Struct2 *var_r30;
    HU3DMODEL *var_r29;

    var_r31 = lbl_1_bss_A4 = HuMemDirectMallocNum(HEAP_SYSTEM, sizeof(UnkM406Struct6), MEMORY_DEFAULT_NUM);
    memset(var_r31, 0, sizeof(UnkM406Struct6));
    var_r31->unk_00 = sp8 = fn_1_C4F4(512);
    Hu3DModelLayerSet(var_r31->unk_00, 3);
    var_r31->unk_04 = 0;
    var_r29 = &Hu3DData[var_r31->unk_00];
    var_r30 = var_r29->hookData;
    var_r30->unk_20 = 0;
}

void fn_1_7F80(void)
{
    UnkM406Struct5 *var_r31;
    UnkM406Struct6 *var_r30;
    UnkM406Unk120Struct2 *var_r29;
    s32 var_r28;
    HU3DMODEL *var_r27;

    var_r30 = lbl_1_bss_A4;
    if (var_r30->unk_04 <= 0) {
        Hu3DModelAttrSet(var_r30->unk_00, HU3D_ATTR_DISPOFF);
        return;
    }
    Hu3DModelAttrReset(var_r30->unk_00, HU3D_ATTR_DISPOFF);
    var_r27 = &Hu3DData[var_r30->unk_00];
    var_r29 = var_r27->hookData;
    var_r31 = var_r29->unk_3C;
    for (var_r28 = 0; var_r28 < var_r29->unk_26; var_r28++, var_r31++) {
        if (var_r31->unk_28 <= 0.0f) {
            continue;
        }
        var_r31->unk_30.x += var_r31->unk_04.x;
        var_r31->unk_30.y += var_r31->unk_04.y;
        var_r31->unk_30.z += var_r31->unk_04.z;
        var_r31->unk_04.y -= var_r31->unk_14;
        if (var_r31->unk_10 != 0.0f) {
            var_r31->unk_28 *= var_r31->unk_10;
        }
        if (++var_r31->unk_00 > var_r31->unk_02 || var_r31->unk_04.y <= 0.0f) {
            var_r31->unk_00 = 0;
            var_r31->unk_28 = 0.0f;
            var_r30->unk_04 = var_r30->unk_04 - 1;
        }
    }
}

void fn_1_8100(void) { }

s32 fn_1_8104(Vec arg0, Vec arg1, float arg8, GXColor arg2)
{
    UnkM406Struct5 *var_r31;
    UnkM406Unk120Struct2 *var_r30;
    UnkM406Struct6 *var_r28;
    s32 var_r29;

    HU3DMODEL *var_r27;

    var_r28 = lbl_1_bss_A4;

    var_r27 = &Hu3DData[var_r28->unk_00];
    var_r30 = var_r27->hookData;
    var_r31 = var_r30->unk_3C;
    for (var_r29 = 0; var_r29 < var_r30->unk_26; var_r29++, var_r31++) {
        if (var_r31->unk_28 <= 0.0f) {

            break;
        }
    }

    if (var_r29 >= var_r30->unk_26) {
        return -1;
    }
    var_r31->unk_00 = var_r31->unk_02 = 0;

    var_r31->unk_30.x = arg0.x;
    var_r31->unk_30.y = arg0.y;
    var_r31->unk_30.z = arg0.z;

    var_r31->unk_04.x = arg1.x;
    var_r31->unk_04.y = arg1.y;
    var_r31->unk_04.z = arg1.z;

    var_r31->unk_14 = 0.49f;
    var_r31->unk_10 = 0.0f;
    var_r31->unk_02 = 30;

    var_r31->unk_28 = arg8;

    var_r31->unk_3C.r = arg2.r;
    var_r31->unk_3C.g = arg2.g;
    var_r31->unk_3C.b = arg2.b;
    var_r31->unk_3C.a = arg2.a;

    var_r31->unk_00 = 0;
    var_r28->unk_04++;
    return var_r29;
}

void fn_1_8244(s32 arg0, s32 arg1, float arg8, float arg9)
{
    UnkM406Struct5 *var_r31;
    UnkM406Unk120Struct2 *var_r30;
    UnkM406Struct6 *var_r29;
    HU3DMODEL *var_r28;

    var_r29 = lbl_1_bss_A4;
    var_r28 = &Hu3DData[var_r29->unk_00];
    var_r30 = var_r28->hookData;
    if (arg0 < 0 || arg0 >= var_r30->unk_26) {
        return;
    }
    var_r31 = &var_r30->unk_3C[arg0];
    var_r31->unk_10 = arg9;
    var_r31->unk_14 = arg8;
    var_r31->unk_02 = arg1;
}

void fn_1_82C8(Mtx arg0, s32 arg1, float arg8)
{
    Mtx sp8C;
    Vec sp80;
    Vec sp74;
    Vec sp68;
    Vec sp5C;
    Vec sp50;
    Vec sp44;

    float var_f31;
    float var_f30;
    float var_f29;

