zeranemesis/Marioparty4/partyboard/src/REL/m406Dll/map.c
    s32 var_r28;

    sp80.x = arg0[0][3];
    sp80.y = arg0[1][3];
    sp80.z = arg0[2][3];
    sp74.x = sp74.z = 0.0f;
    sp74.y = atan2d(arg0[0][0], arg0[2][0]);
    MTXCopy(arg0, sp8C);
#ifdef NON_MATCHING
    sp8C[0][3] = sp8C[1][3] = sp8C[2][3] = 0.0f;
#else
    sp8C[0][3] = sp8C[1][3] = sp8C[2][3] = sp8C[3][3] = 0.0f;
#endif
    sp68.x = -25.0f;
    sp68.z = -50.0f;
    sp68.y = 0.0f;
    fn_1_D518(sp8C, &sp68);
    sp68.x += sp80.x;
    sp68.y += sp80.y;
    sp68.z += sp80.z;

    sp5C.x = -25.0f;
    sp5C.z = 50.0f;
    sp5C.y = 0.0f;
    fn_1_D518(sp8C, &sp5C);
    sp5C.x += sp80.x;
    sp5C.y += sp80.y;
    sp5C.z += sp80.z;
    mtxRotCat(sp8C, 0.0f, 180.0f + (90.0f - (45.0f * (0.007874016f * (frand() & 0x7F)))), 0.0f);
    lbl_1_data_89B.a = arg8;
    var_f30 = sp8C[0][2];
    var_f29 = sp8C[2][2];
    for (var_r28 = 0; var_r28 < (arg1 >> 1); var_r28++) {
        fn_1_D488(0.007874016f * (frand() & 0x7F), &sp68, &sp5C, &sp50);
        sp50.x += 100.0f * (0.1f * ((0.007874016f * (frand() & 0x7F)) - 0.5f));
        sp50.y += 100.0f * (0.1f * ((0.007874016f * (frand() & 0x7F)) - 0.5f));
        sp50.z += 100.0f * (0.1f * ((0.007874016f * (frand() & 0x7F)) - 0.5f));

        sp44.x = 2.0f * var_f30 * (1.0f + (0.007874016f * (frand() & 0x7F)));
        sp44.z = 2.0f * var_f29 * (1.0f + (0.007874016f * (frand() & 0x7F)));
        sp44.y = 5.0f * (1.0f + (0.7f * (0.007874016f * (frand() & 0x7F))));
        var_f31 = 5.0f + (15.0f * (0.007874016f * (frand() & 0x7F)));

        fn_1_8104(sp50, sp44, var_f31, lbl_1_data_89B);
    }
    sp68.x = -25.0f;
    sp68.z = -50.0f;
    sp68.y = 0.0f;
    fn_1_D518(sp8C, &sp68);
    sp68.x += sp80.x;
    sp68.y += sp80.y;
    sp68.z = sp68.z + sp80.z;
    sp5C.x = -25.0f;
    sp5C.z = 50.0f;
    sp5C.y = 0.0f;
    fn_1_D518(sp8C, &sp5C);
    sp5C.x += sp80.x;
    sp5C.y += sp80.y;
    sp5C.z += sp80.z;
    for (var_r28 = 0; var_r28 < (arg1 >> 1); var_r28++) {
        fn_1_D488(0.007874016f * (frand() & 0x7F), &sp68, &sp5C, &sp50);
        sp50.x += 100.0f * (0.1f * ((0.007874016f * (frand() & 0x7F)) - 0.5f));
        sp50.y += 100.0f * (0.1f * ((0.007874016f * (frand() & 0x7F)) - 0.5f));
        sp50.z += 100.0f * (0.1f * ((0.007874016f * (frand() & 0x7F)) - 0.5f));

        sp44.x = 2.0f * var_f30 * (1.0f + (0.007874016f * (frand() & 0x7F)));
        sp44.z = 2.0f * var_f29 * (1.0f + (0.007874016f * (frand() & 0x7F)));
        sp44.y = 5.0f * (1.0f + (0.7f * (0.007874016f * (frand() & 0x7F))));
        var_f31 = 5.0f + (15.0f * (0.007874016f * (frand() & 0x7F)));

        fn_1_8104(sp50, sp44, var_f31, lbl_1_data_89B);
    }
}

void fn_1_8F98(void)
{
    UnkM406Struct7 *var_r31;
    s32 var_r30;

    var_r31 = lbl_1_bss_A0 = HuMemDirectMallocNum(HEAP_SYSTEM, 128 * sizeof(UnkM406Struct7), MEMORY_DEFAULT_NUM);
    memset(lbl_1_bss_A0, 0, 128 * sizeof(UnkM406Struct7));
    for (var_r30 = 0, var_r31 = lbl_1_bss_A0; var_r30 < 64; var_r30++, var_r31++) {
        var_r31->unk_00 = 0;
        var_r31->unk_01 = 0;
        var_r31->unk_08 = 0;
        var_r31->unk_0C = 0.0f;
        var_r31->unk_10 = 0.0f;
        var_r31->unk_14 = 6.0f;
        var_r31->unk_18 = 1.0f;
        MTXIdentity(var_r31->unk_1C);
        if (var_r30 == 0) {
            var_r31->unk_04 = Hu3DModelCreateFile(DATA_MAKE_NUM(DATADIR_M406, 59));
        }
        else {
            var_r31->unk_04 = Hu3DModelLink(lbl_1_bss_A0->unk_04);
        }
        Hu3DModelLayerSet(var_r31->unk_04, 3);
        Hu3DModelAttrSet(var_r31->unk_04, HU3D_ATTR_DISPOFF);
    }

    for (var_r30 = 0, var_r31 = &lbl_1_bss_A0[64]; var_r30 < 64; var_r30++, var_r31++) {
        var_r31->unk_00 = 0;
        var_r31->unk_01 = 0;
        var_r31->unk_08 = 0;
        var_r31->unk_0C = 0.0f;
        var_r31->unk_10 = 0.0f;
        var_r31->unk_14 = 6.0f;
        var_r31->unk_18 = 1.0f;
        MTXIdentity(var_r31->unk_1C);
        if (var_r30 == 0) {
            var_r31->unk_04 = Hu3DModelCreateFile(DATA_MAKE_NUM(DATADIR_M406, 60));
        }
        else {
            var_r31->unk_04 = Hu3DModelLink(lbl_1_bss_A0[64].unk_04);
        }
        Hu3DModelLayerSet(var_r31->unk_04, 3);
        Hu3DModelAttrSet(var_r31->unk_04, HU3D_ATTR_DISPOFF);
    }
}

void fn_1_91E0(void)
{
    Mtx sp8;

    float var_f31;
    float var_f30;

    UnkM406Struct7 *var_r31;
    HU3DMODEL *var_r30;
    s32 var_r29;

    var_r31 = lbl_1_bss_A0;
    for (var_r29 = 0, var_r31 = lbl_1_bss_A0; var_r29 < 64; var_r29++, var_r31++) {
        if (!var_r31->unk_00) {
            continue;
        }
        var_f30 = var_r31->unk_0C / var_r31->unk_14;
        var_f31 = var_r31->unk_18 * cosd((90.0f * var_f30));
        var_f31 = var_f31;
        var_r30 = &Hu3DData[var_r31->unk_04];
        MTXScale(sp8, var_f31, var_f31, var_f31);
        MTXConcat(var_r31->unk_1C, sp8, var_r30->mtx);
        var_r30->mtx[0][3] = var_r31->unk_1C[0][3];
        var_r30->mtx[1][3] = var_r31->unk_1C[1][3];
        var_r30->mtx[2][3] = var_r31->unk_1C[2][3];
        Hu3DModelTPLvlSet(var_r31->unk_04, 1.0f - var_f30);
        if ((var_r31->unk_0C += var_r31->unk_10) >= var_r31->unk_14) {
            Hu3DModelAttrSet(var_r31->unk_04, HU3D_ATTR_DISPOFF);
            var_r31->unk_00 = 0;
            var_r31->unk_0C = 0.0f;
        }
        var_r31->unk_08++;
    }
    for (var_r29 = 0, var_r31 = &lbl_1_bss_A0[64]; var_r29 < 64; var_r29++, var_r31++) {
        if (!var_r31->unk_00) {
            continue;
        }
        var_f30 = var_r31->unk_0C / var_r31->unk_14;
        var_f31 = var_r31->unk_18 * cosd((90.0f * var_f30));
        var_f31 = var_f31;
        var_r30 = &Hu3DData[var_r31->unk_04];
        MTXScale(sp8, var_f31, var_f31, var_f31);
        MTXConcat(var_r31->unk_1C, sp8, var_r30->mtx);
        var_r30->mtx[0][3] = var_r31->unk_1C[0][3];
        var_r30->mtx[1][3] = var_r31->unk_1C[1][3];
        var_r30->mtx[2][3] = var_r31->unk_1C[2][3];
        Hu3DModelTPLvlSet(var_r31->unk_04, 1.0f - var_f30);
        if ((var_r31->unk_0C += var_r31->unk_10) >= var_r31->unk_14) {
            Hu3DModelAttrSet(var_r31->unk_04, HU3D_ATTR_DISPOFF);
            var_r31->unk_00 = 0;
            var_r31->unk_0C = 0.0f;
        }
        var_r31->unk_08++;
    }
}

void fn_1_94BC(void) { }

s32 fn_1_94C0(Mtx arg0, s32 arg1, s32 arg2)
{
    Mtx spA0;
    Mtx sp70;
    Vec sp64;
    Vec sp58;
    Vec sp4C;
    Vec sp40;
    Vec sp34;
    Vec sp28;

    float var_f31;
    float var_f30;
    float var_f29;

    UnkM406Struct7 *var_r31;
    s32 var_r28;
    HU3DMODEL *var_r27;

