zeranemesis/Marioparty4/partyboard/src/REL/m406Dll/map.c
    sp64.x = arg0[0][3];
    sp64.y = arg0[1][3];
    sp64.z = arg0[2][3];
    sp58.x = sp58.z = 0.0f;
    sp58.y = atan2d(arg0[0][0], arg0[2][0]);
    MTXCopy(arg0, spA0);
#ifdef NON_MATCHING
    spA0[0][3] = spA0[1][3] = spA0[2][3] = 0.0f;
#else
    spA0[0][3] = spA0[1][3] = spA0[2][3] = spA0[3][3] = 0.0f;
#endif

    if (!arg2) {
        sp4C.x = 25.0f;
        sp4C.z = -50.0f;
        sp4C.y = 0.0f;
        fn_1_D518(spA0, &sp4C);
        sp4C.x += sp64.x;
        sp4C.y += sp64.y;
        sp4C.z += sp64.z;
        sp40.x = 25.0f;
        sp40.z = 50.0f;
        sp40.y = 0.0f;
        fn_1_D518(spA0, &sp40);
        sp40.x += sp64.x;
        sp40.y += sp64.y;
        sp40.z += sp64.z;
        mtxRotCat(spA0, 0.0f, 180.0f + (45.0f * (0.007874016f * (frand() & 0x7F))), 0.0f);
    }
    else {
        sp4C = sp64;
        sp4C.x = -25.0f;
        sp4C.z = -50.0f;
        sp4C.y = 0.0f;
        fn_1_D518(spA0, &sp4C);
        sp4C.x += sp64.x;
        sp4C.y += sp64.y;
        sp4C.z += sp64.z;
        sp40 = sp64;
        sp40.x = -25.0f;
        sp40.z = 50.0f;
        sp40.y = 0.0f;
        fn_1_D518(spA0, &sp40);
        sp40.x += sp64.x;
        sp40.y += sp64.y;
        sp40.z += sp64.z;
        mtxRotCat(spA0, 0.0f, 180.0f - (45.0f * (0.007874016f * (frand() & 0x7F))), 0.0f);
    }
    var_f30 = spA0[0][2];
    var_f29 = spA0[2][2];
    for (var_r28 = 0; var_r28 < arg1; var_r28++) {
        fn_1_D488(0.007874016f * (frand() & 0x7F), &sp4C, &sp40, &sp34);
        sp34.x += 100.0f * (0.1f * ((0.007874016f * (frand() & 0x7F)) - 0.5f));
        sp34.y += 100.0f * (0.1f * ((0.007874016f * (frand() & 0x7F)) - 0.5f));
        sp34.z += 100.0f * (0.1f * ((0.007874016f * (frand() & 0x7F)) - 0.5f));
        sp28.x = 2.0f * var_f30 * (1.0f + (0.007874016f * (frand() & 0x7F)));
        sp28.z = 2.0f * var_f29 * (1.0f + (0.007874016f * (frand() & 0x7F)));
        sp28.y = 5.0f * (1.0f + (0.7f * (0.007874016f * (frand() & 0x7F))));

        fn_1_8104(sp34, sp28, 7.5f, lbl_1_data_89F);
    }
    var_r31 = lbl_1_bss_A0;
    if (!arg2) {
        for (var_r28 = 0, var_r31 = lbl_1_bss_A0; var_r28 < 64; var_r28++, var_r31++) {
            if (!var_r31->unk_00) {
                break;
            }
        }
        if (var_r28 >= 64) {
            return -1;
        }
    }
    else {
        for (var_r28 = 0, var_r31 = &lbl_1_bss_A0[64]; var_r28 < 64; var_r28++, var_r31++) {
            if (!var_r31->unk_00) {
                break;
            }
        }
        if (var_r28 >= 64) {
            return -1;
        }
    }
    var_f31 = 1.2f * (2.0f + (0.007874016f * (frand() & 0x7F)));
    var_r31->unk_00 = 1;
    var_r31->unk_08 = 0;
    var_r31->unk_0C = 0.0f;
    var_r31->unk_10 = 1.0f;
    var_r31->unk_14 = 6.0f;
    var_r31->unk_18 = var_f31;
    MTXCopy(arg0, var_r31->unk_1C);
    Hu3DMotionTimeSet(var_r31->unk_04, 0.0f);
    Hu3DMotionSpeedSet(var_r31->unk_04, 0.0f);
    var_r27 = &Hu3DData[var_r31->unk_04];
    MTXScale(sp70, var_f31, var_f31, var_f31);
    MTXConcat(arg0, sp70, var_r27->mtx);
    var_r27->mtx[0][3] = arg0[0][3];
    var_r27->mtx[1][3] = arg0[1][3];
    var_r27->mtx[2][3] = arg0[2][3];
    Hu3DModelPosSet(var_r31->unk_04, 0.0f, 0.0f, 0.0f);
    Hu3DModelRotSet(var_r31->unk_04, 0.0f, 0.0f, 0.0f);
    Hu3DModelScaleSet(var_r31->unk_04, 1.0f, 1.0f, 1.0f);
    Hu3DModelAttrReset(var_r31->unk_04, HU3D_ATTR_DISPOFF);
    (void)var_r31;
    return var_r28;
}

void fn_1_9F78(void)
{
    UnkM406Unk120Struct2 *var_r31;
    UnkM406Struct8 *var_r30;
    HU3DMODEL *var_r29;
    UnkM406Struct9 *var_r28;
    s32 var_r27;

    var_r30 = lbl_1_bss_9C = HuMemDirectMallocNum(HEAP_SYSTEM, sizeof(UnkM406Struct8), MEMORY_DEFAULT_NUM);
    memset(var_r30, 0, sizeof(UnkM406Struct8));
    var_r30->unk_00 = HuSprAnimRead(HuDataReadNum(DATA_MAKE_NUM(DATADIR_M406, 0x40), MEMORY_DEFAULT_NUM));
    var_r30->unk_04 = HuSprAnimRead(HuDataReadNum(DATA_MAKE_NUM(DATADIR_M406, 0x41), MEMORY_DEFAULT_NUM));
    var_r30->unk_08 = HuSprAnimRead(HuDataReadNum(DATA_MAKE_NUM(DATADIR_M406, 0x42), MEMORY_DEFAULT_NUM));
    var_r30->unk_0C = HuSprAnimRead(HuDataReadNum(DATA_MAKE_NUM(DATADIR_M406, 0x43), MEMORY_DEFAULT_NUM));
    var_r30->unk_24 = 0.0f;
    var_r30->unk_28 = 0.0f;
    var_r27 = fn_1_B474(var_r30->unk_00, 1);
    var_r30->unk_10 = var_r27;
    Hu3DModelLayerSet(var_r27, 6);
    var_r29 = &Hu3DData[var_r27];
    var_r31 = var_r29->hookData;
    var_r31->unk_20 = 1;
    var_r31->unk_22 = 2;
    var_r31->unk_4C = fn_1_A2C8;
    var_r28 = var_r31->unk_1C = HuMemDirectMallocNum(HEAP_DATA, sizeof(UnkM406Struct9), var_r29->mallocNo);
    memset(var_r28, 0, 8);
    var_r28->unk_02 = 0;
    var_r27 = fn_1_B474(var_r30->unk_0C, 0xA);
    var_r30->unk_14 = var_r27;
    Hu3DModelLayerSet(var_r27, 6);
    var_r29 = &Hu3DData[var_r27];
    var_r31 = var_r29->hookData;
    var_r31->unk_20 = 1;
    var_r31->unk_22 = 3;
    var_r31->unk_4C = fn_1_A2C8;
    var_r28 = var_r31->unk_1C = HuMemDirectMallocNum(HEAP_DATA, sizeof(UnkM406Struct9), var_r29->mallocNo);
    memset(var_r28, 0, 8);
    var_r28->unk_02 = 1;
    var_r27 = fn_1_B474(var_r30->unk_08, 4);
    var_r30->unk_18 = var_r27;
    Hu3DModelLayerSet(var_r27, 6);
    var_r29 = &Hu3DData[var_r27];
    var_r31 = var_r29->hookData;
    var_r31->unk_20 = 1;
    var_r31->unk_22 = 3;
    var_r31->unk_4C = fn_1_A2C8;
    var_r28 = var_r31->unk_1C = HuMemDirectMallocNum(HEAP_DATA, sizeof(UnkM406Struct9), var_r29->mallocNo);
    memset(var_r28, 0, 8);
    var_r28->unk_02 = 2;
    var_r27 = fn_1_B474(var_r30->unk_04, 6);
    var_r30->unk_1C = var_r27;
    Hu3DModelLayerSet(var_r27, 6);
    var_r29 = &Hu3DData[var_r27];
    var_r31 = var_r29->hookData;
    var_r31->unk_20 = 1;
    var_r31->unk_22 = 3;
    var_r31->unk_4C = fn_1_A2C8;
    var_r28 = var_r31->unk_1C = HuMemDirectMallocNum(HEAP_DATA, sizeof(UnkM406Struct9), var_r29->mallocNo);
    memset(var_r28, 0, 8);
    var_r28->unk_02 = 3;
    var_r30->unk_20 = Hu3DHookFuncCreate(fn_1_ADB4);
    Hu3DModelLayerSet(var_r30->unk_20, 7);
}

