zeranemesis/Marioparty4/partyboard/src/REL/m406Dll/map.c
void fn_1_A278(void)
{
    UnkM406Struct8 *var_r31;

    var_r31 = lbl_1_bss_9C;
    HuSprAnimKill(var_r31->unk_00);
    HuSprAnimKill(var_r31->unk_04);
    HuSprAnimKill(var_r31->unk_08);
    HuSprAnimKill(var_r31->unk_0C);
}

void fn_1_A2C8(HU3DMODEL *arg0, UnkM406Unk120Struct2 *arg1, Mtx arg2)
{
    Vec sp3C;
    Vec sp30;
    Vec sp24;
    Vec sp18;
    void *sp14;
    s16 sp8;

    float var_f29;
    float var_f28;
    float var_f27;
    float var_f26;
    float var_f25;
    float var_f24;

    UnkM406Struct5 *var_r31;
    UnkM406Struct9 *var_r29;
    s32 var_r28;

    sp8 = 0;
    sp14 = lbl_1_bss_9C;
    var_r29 = arg1->unk_1C;
    switch (var_r29->unk_04) {
        case 0:
            var_r31 = arg1->unk_3C;
            if (var_r29->unk_02) {
                sp18.x = 10000.0f;
                sp18.y = -20000.0f;
                sp18.z = -20000.0f;
                var_f28 = (sp18.z * sp18.z) + ((sp18.x * sp18.x) + (sp18.y * sp18.y));
                var_f29 = 1.0f / sqrtf(var_f28);
                sp18.x *= var_f29;
                sp18.y *= var_f29;
                sp18.z *= var_f29;
                var_f24 = 6500.0f / arg1->unk_26;
                for (var_r28 = 0; var_r28 < arg1->unk_26; var_r28++, var_r31++) {
                    var_f26 = 500.0 + ((var_f24 * var_r28) + ((0.25f * var_f24) * (1.52587890625e-05 * (float)(frand() & 0xFFFF))));
                    var_f25 = var_f26 / 6500.0f;
                    var_r31->unk_10 = var_f26;
                    var_r31->unk_30.x = var_f26 * sp18.x;
                    var_r31->unk_30.y = -27000.0f + (var_f26 * sp18.y);
                    var_r31->unk_30.z = -63000.0f + (var_f26 * sp18.z);
                    var_r31->unk_28 = (0.3f + (0.7f * (var_f25 * var_f25)))
                        * (lbl_1_data_8A4[var_r29->unk_02]
                            * (0.699999988079071 + (0.30000001192092896 * (1.52587890625e-05 * (float)(frand() & 0xFFFF)))));
                    var_r31->unk_3C.r = (s32)(160.0 * (1.52587890625e-05 * (float)(frand() & 0xFFFF))) + 0x20;
                    var_r31->unk_3C.g = (s32)(96.0 * (1.52587890625e-05 * (float)(frand() & 0xFFFF))) + 0x20;
                    var_r31->unk_3C.b = (s32)(128.0 * (1.52587890625e-05 * (float)(frand() & 0xFFFF))) + 0x20;
                    var_r31->unk_3C.a = ((1.0 - (0.4 * var_f25)) * (255.0f * lbl_1_data_8B4[var_r29->unk_02]))
                        - (int)(16.0 * (1.52587890625e-05 * (float)(frand() & 0xFFFF)));
                }
                var_r29->unk_04++;
            }
            else {
                var_r31->unk_30.x = 0.0f;
                var_r31->unk_30.y = -27000.0f;
                var_r31->unk_30.z = -63000.0f;
                var_r31->unk_28 = 1000.0f;
            }
            break;
        case 1:
            sp3C.x = sind(CRot.y) * cosd(CRot.x);
            sp3C.y = -sind(CRot.x);
            sp3C.z = cosd(CRot.y) * cosd(CRot.x);
            sp30.x = -(Center.x + (1.25f * (sp3C.x * CZoom)));
            sp30.y = -27000.0f - (Center.y + (sp3C.y * CZoom));
            sp30.z = -63000.0f - (Center.z + (1.25f * (sp3C.z * CZoom)));
            var_f27 = (sp30.z * sp30.z) + ((sp30.x * sp30.x) + (sp30.y * sp30.y));
            var_f29 = 1.0f / sqrtf(var_f27);
            sp30.x *= var_f29;
            sp30.y *= var_f29;
            sp30.z *= var_f29;
            var_f29 = -((-sp30.z * -sp3C.z) + ((-sp30.x * -sp3C.x) + (-sp30.y * -sp3C.y)));
            sp24.x = -sp3C.x + (-2.0f * sp30.x * var_f29);
            sp24.y = -sp3C.y + (-2.0f * sp30.y * var_f29);
            sp24.z = -sp3C.z + (-2.0f * sp30.z * var_f29);
            var_r31 = arg1->unk_3C;
            for (var_r28 = 0; var_r28 < arg1->unk_26; var_r28++, var_r31++) {
                var_r31->unk_30.x = sp24.x * var_r31->unk_10;
                var_r31->unk_30.y = -27000.0f + (sp24.y * var_r31->unk_10);
                var_r31->unk_30.z = -63000.0f + (sp24.z * var_r31->unk_10);
            }
            break;
        default:
            break;
    }
    DCFlushRange(arg1->unk_3C, arg1->unk_26 * sizeof(UnkM406Struct5));
    PPCSync();
}

void fn_1_ADB4(HU3DMODEL *arg0, float (*arg1)[4])
{
    Mtx sp50;
    Mtx44 sp10;

    HU3DCAMERA *var_r31;
    UnkM406Struct8 *var_r30;

    GXColor spC = { 0xFF, 0xFF, 0xFF, 0xFF };
    var_r31 = &Hu3DCamera[0];
    var_r30 = lbl_1_bss_9C;
    if (var_r30->unk_28 <= 0.0f) {
        Hu3DModelAttrSet(var_r30->unk_20, HU3D_ATTR_DISPOFF);
        return;
    }
    GXSetScissor(var_r31->scissorX, var_r31->scissorY, var_r31->scissorW, var_r31->scissorH);
    GXSetViewport(0.0f, 0.0f, HU_FB_WIDTHF, HU_FB_HEIGHTF, 0.0f, 1.0f);
    C_MTXOrtho(sp10, 0.0f, 1.0f, 0.0f, 1.0f, 0.0f, 1.0f);
    GXSetProjection(sp10, GX_ORTHOGRAPHIC);
    spC.a = 255.0f * var_r30->unk_28;
    GXSetTevColor(GX_TEVREG0, spC);
    GXSetNumTexGens(0);
    GXSetNumTevStages(1);
    GXSetTevOrder(GX_TEVSTAGE0, GX_TEXCOORD_NULL, GX_TEXMAP_NULL, GX_COLOR0A0);
    GXSetTevColorIn(GX_TEVSTAGE0, GX_CC_ZERO, GX_CC_ZERO, GX_CC_ZERO, GX_CC_C0);
    GXSetTevColorOp(GX_TEVSTAGE0, GX_TEV_ADD, GX_TB_ZERO, GX_CS_SCALE_1, GX_TRUE, GX_TEVPREV);
    GXSetTevAlphaIn(GX_TEVSTAGE0, GX_CA_ZERO, GX_CA_ZERO, GX_CA_ZERO, GX_CA_A0);
    GXSetTevAlphaOp(GX_TEVSTAGE0, GX_TEV_ADD, GX_TB_ZERO, GX_CS_SCALE_1, GX_TRUE, GX_TEVPREV);
    MTXIdentity(sp50);
    GXLoadPosMtxImm(sp50, 0);
    GXSetZMode(GX_FALSE, GX_ALWAYS, GX_TRUE);
    GXSetNumChans(1);
    GXSetChanCtrl(GX_COLOR0A0, GX_FALSE, GX_SRC_REG, GX_SRC_REG, 0, GX_DF_CLAMP, GX_AF_NONE);
    GXClearVtxDesc();
    GXSetVtxDesc(GX_VA_POS, GX_DIRECT);
    GXSetVtxAttrFmt(GX_VTXFMT0, GX_VA_POS, GX_POS_XYZ, GX_U8, 0);
    GXBegin(GX_QUADS, GX_VTXFMT0, 4);
    GXPosition3u8(0, 0, 0);
    GXPosition3u8(1, 0, 0);
    GXPosition3u8(1, 1, 0);
    GXPosition3u8(0, 1, 0);
    GXEnd();
}

void fn_1_B104(float arg8)
{

    UnkM406Struct8 *var_r31;

    var_r31 = lbl_1_bss_9C;
    var_r31->unk_24 = arg8;
    if (var_r31->unk_24 <= 0.0f) {
        Hu3DModelAttrSet(var_r31->unk_10, HU3D_ATTR_DISPOFF);
        Hu3DModelAttrSet(var_r31->unk_14, HU3D_ATTR_DISPOFF);
        Hu3DModelAttrSet(var_r31->unk_18, HU3D_ATTR_DISPOFF);
        Hu3DModelAttrSet(var_r31->unk_1C, HU3D_ATTR_DISPOFF);
        return;
    }
    Hu3DModelAttrReset(var_r31->unk_10, HU3D_ATTR_DISPOFF);
    Hu3DModelAttrReset(var_r31->unk_14, HU3D_ATTR_DISPOFF);
    Hu3DModelAttrReset(var_r31->unk_18, HU3D_ATTR_DISPOFF);
    Hu3DModelAttrReset(var_r31->unk_1C, HU3D_ATTR_DISPOFF);
}

void fn_1_B1E0(float arg8)
{
    UnkM406Struct8 *var_r31;

    var_r31 = lbl_1_bss_9C;
    var_r31->unk_28 = arg8;
    if (var_r31->unk_28 <= 0.0f) {
        Hu3DModelAttrSet(var_r31->unk_20, HU3D_ATTR_DISPOFF);
        return;
    }
    Hu3DModelAttrReset(var_r31->unk_20, HU3D_ATTR_DISPOFF);
}

void fn_1_B25C(void)
{
    s32 var_r31;
    s32 var_r30;

    if (lbl_1_bss_98 == -1) {
        lbl_1_bss_98 = Hu3DModelCreateFile(DATA_MAKE_NUM(DATADIR_M406, 68));
        Hu3DModelLayerSet(lbl_1_bss_98, 0);
        Hu3DModelPosSet(lbl_1_bss_98, 0.0f, -26500.0f, -63000.0f);
        Hu3DModelRotSet(lbl_1_bss_98, 0.0f, 0.0f, 0.0f);
        Hu3DModelScaleSet(lbl_1_bss_98, 2.75f, 2.75f, 2.75f);
        var_r30 = Hu3DModelCreateFile(DATA_MAKE_NUM(DATADIR_M406, 55));
        Hu3DModelLayerSet(var_r30, 0);
        var_r31 = Hu3DGLightCreateV(&lbl_1_data_8C4, &lbl_1_data_8D0, &lbl_1_data_8DC);
        Hu3DGLightStaticSet(var_r31, 1);
        Hu3DGLightPointSet(var_r31, 100.0f, 1.0f, 3);
        lbl_1_bss_BC = 0;
        fn_1_2C24(lbl_1_bss_CC);
    }
}

void fn_1_B41C(void)
{
    if (lbl_1_bss_98 != -1) {
        Hu3DModelKill(lbl_1_bss_98);
    }
    lbl_1_bss_98 = -1;
}

void fn_1_B470(void) { }

s16 fn_1_B474(ANIMDATA *arg0, s16 arg1)
{
    UnkM406Unk120Struct2 *var_r31;
    s16 var_r30;
    Vec2f *var_r29;
    UnkM406Struct5 *var_r28;
    HU3DMODEL *var_r27;
    Vec *var_r25;
    void *var_r24;
    s16 var_r23;
    void *var_r22;

    var_r23 = Hu3DHookFuncCreate(fn_1_BC18);
    var_r27 = &Hu3DData[var_r23];
    var_r31 = HuMemDirectMallocNum(HEAP_DATA, sizeof(UnkM406Unk120Struct2), var_r27->mallocNo);
    var_r27->hookData = var_r31;
    var_r31->unk_38 = arg0;
    var_r31->unk_26 = arg1;
    var_r31->unk_20 = 0;
    var_r31->unk_22 = 0;
    var_r31->unk_4C = 0;
    var_r31->unk_50 = 0;
    var_r31->unk_28 = 0;
    var_r31->unk_21 = 0;
    var_r31->unk_30 = 0;

    var_r31->unk_00 = var_r31->unk_02 = 0;
    var_r28 = HuMemDirectMallocNum(HEAP_DATA, arg1 * sizeof(UnkM406Struct5), var_r27->mallocNo);
    var_r31->unk_3C = var_r28;
    memset(var_r28, 0, arg1 * sizeof(UnkM406Struct5));
    for (var_r30 = 0; var_r30 < arg1; var_r30++, var_r28++) {
        var_r28->unk_28 = 0.0f;
        var_r28->unk_2C = 0.0f;
        var_r28->unk_30.x = ((frand() & 0x7F) - 0x40) * 0x14;
        var_r28->unk_30.y = ((frand() & 0x7F) - 0x40) * 0x1E;
        var_r28->unk_30.z = ((frand() & 0x7F) - 0x40) * 0x14;
        var_r28->unk_3C.r = var_r28->unk_3C.g = var_r28->unk_3C.b = var_r28->unk_3C.a = 0xFF;
        var_r28->unk_40 = 0;
    }
    var_r25 = HuMemDirectMallocNum(HEAP_DATA, arg1 * sizeof(Vec) * 4, var_r27->mallocNo);
    var_r31->unk_40 = var_r25;
    for (var_r30 = 0; var_r30 < (arg1 * 4); var_r30++, var_r25++) {
        var_r25->x = var_r25->y = var_r25->z = 0.0f;
    }
    var_r29 = HuMemDirectMallocNum(HEAP_DATA, arg1 * sizeof(Vec2f) * 4, var_r27->mallocNo);
    var_r31->unk_44 = var_r29;
    for (var_r30 = 0; var_r30 < arg1; var_r30++) {
        var_r29->x = 0.0f;
        var_r29->y = 0.0f;
        var_r29++;
        var_r29->x = 1.0f;
        var_r29->y = 0.0f;
        var_r29++;
        var_r29->x = 1.0f;
        var_r29->y = 1.0f;
        var_r29++;
        var_r29->x = 0.0f;
        var_r29->y = 1.0f;
        var_r29++;
    }
    var_r24 = HuMemDirectMallocNum(HEAP_DATA, 0x10000, var_r27->mallocNo);
    var_r22 = var_r24;
    DCFlushRange(var_r24, 0x10000);
    GXBeginDisplayList(var_r22, 0x10000);
    GXBegin(GX_QUADS, GX_VTXFMT0, arg1 * 4);
    for (var_r30 = 0; var_r30 < arg1; var_r30++) {
        GXPosition1x16(var_r30 * 4);
        GXColor1x16(var_r30);
        GXTexCoord1x16(var_r30 * 4);

