zeranemesis/Marioparty4/partyboard/src/REL/m406Dll/map.c
        GXPosition1x16(var_r30 * 4 + 1);
        GXColor1x16(var_r30);
        GXTexCoord1x16(var_r30 * 4 + 1);

        GXPosition1x16(var_r30 * 4 + 2);
        GXColor1x16(var_r30);
        GXTexCoord1x16(var_r30 * 4 + 2);

        GXPosition1x16(var_r30 * 4 + 3);
        GXColor1x16(var_r30);
        GXTexCoord1x16(var_r30 * 4 + 3);
    }
    GXEnd();
    var_r31->unk_34 = GXEndDisplayList();
    var_r31->unk_48 = HuMemDirectMallocNum(HEAP_DATA, var_r31->unk_34, var_r27->mallocNo);
    memcpy(var_r31->unk_48, var_r24, var_r31->unk_34);
    DCFlushRange(var_r31->unk_48, var_r31->unk_34);
    HuMemDirectFree(var_r24);
    (void)arg1;
    return var_r23;
}

s16 fn_1_B8FC(s16 arg0)
{
    UnkM406Unk120Struct2 *var_r31;
    Vec2f *var_r30;
    UnkM406Struct5 *var_r29;
    HU3DMODEL *var_r27;
    s16 var_r28;
    UnkM406Unk120Struct2 *var_r26;
    Vec *var_r25;
    s32 var_r24;
    HU3DMODEL *var_r23;
    s16 var_r22;

    var_r23 = &Hu3DData[arg0];
    var_r26 = var_r23->hookData;
    var_r22 = Hu3DHookFuncCreate(var_r23->hookFunc);
    var_r27 = &Hu3DData[var_r22];
    var_r31 = HuMemDirectMallocNum(HEAP_DATA, sizeof(UnkM406Unk120Struct2), var_r27->mallocNo);
    var_r27->hookData = var_r31;
    var_r31->unk_38 = var_r26->unk_38;
    var_r31->unk_26 = var_r26->unk_26;
    var_r24 = var_r31->unk_26;
    var_r31->unk_20 = 0;
    var_r31->unk_22 = var_r26->unk_22;
    var_r31->unk_4C = 0;
    var_r31->unk_50 = 0;
    var_r31->unk_28 = 0;
    var_r31->unk_21 = 0;
    var_r31->unk_30 = 0;

    var_r31->unk_00 = var_r31->unk_02 = 0;
    var_r29 = HuMemDirectMallocNum(HEAP_DATA, var_r24 * sizeof(UnkM406Struct5), var_r27->mallocNo);
    var_r31->unk_3C = var_r29;
    for (var_r28 = 0; var_r28 < var_r24; var_r28++, var_r29++) {
        var_r29->unk_28 = 0.0f;
        var_r29->unk_2C = 0.0f;
        var_r29->unk_30.x = ((frand() & 0x7F) - 0x40) * 0x14;
        var_r29->unk_30.y = ((frand() & 0x7F) - 0x40) * 0x1E;
        var_r29->unk_30.z = ((frand() & 0x7F) - 0x40) * 0x14;
        var_r29->unk_3C.r = var_r29->unk_3C.g = var_r29->unk_3C.b = var_r29->unk_3C.a = 0xFF;
        var_r29->unk_40 = 0;
    }
    var_r25 = HuMemDirectMallocNum(HEAP_DATA, var_r24 * sizeof(Vec) * 4, var_r27->mallocNo);
    var_r31->unk_40 = var_r25;
    for (var_r28 = 0; var_r28 < (var_r24 * 4); var_r28++, var_r25++) {
        var_r25->x = var_r25->y = var_r25->z = 0.0f;
    }
    var_r30 = HuMemDirectMallocNum(HEAP_DATA, var_r24 * sizeof(Vec2f) * 4, var_r27->mallocNo);
    var_r31->unk_44 = var_r30;
    for (var_r28 = 0; var_r28 < var_r24; var_r28++) {
        var_r30->x = 0.0f;
        var_r30->y = 0.0f;
        var_r30++;
        var_r30->x = 1.0f;
        var_r30->y = 0.0f;
        var_r30++;
        var_r30->x = 1.0f;
        var_r30->y = 1.0f;
        var_r30++;
        var_r30->x = 0.0f;
        var_r30->y = 1.0f;
        var_r30++;
    }
    var_r31->unk_34 = var_r26->unk_34;
    var_r31->unk_48 = var_r26->unk_48;
    return var_r22;
}

void fn_1_BC18(HU3DMODEL *arg0, float (*arg1)[4])
{
    Mtx sp128;
    Mtx spF8;
    Mtx spC8;
    Vec sp98[4];
    Vec sp68[4];
    Vec sp38[4];
    ROMtx sp8;

    UnkM406Unk120Struct2 *var_r31;
    Vec *var_r30;
    UnkM406Struct5 *var_r29;
    Vec2f *var_r28;
    Vec *var_r27;
    s16 var_r26;
    s16 var_r25;
    Vec *var_r24;
    s16 var_r21;
    s16 var_r20;
    s16 var_r19;
    UnkM406Unk120Struct2Hook var_r18;

    var_r31 = arg0->hookData;
    if (var_r31->unk_2C != GlobalCounter || shadowModelDrawF) {
        if (var_r31->unk_50 && var_r31->unk_50 != arg0) {
            fn_1_BC18(var_r31->unk_50, arg1);
        }
        GXLoadPosMtxImm(arg1, 0);
        GXSetNumTevStages(1);
        GXSetNumTexGens(1);
        GXSetTexCoordGen2(GX_TEXCOORD0, GX_TG_MTX2x4, GX_TG_TEX0, 0x3C, GX_FALSE, 0x7D);
        GXSetTevOrder(GX_TEVSTAGE0, GX_TEXCOORD0, GX_TEXMAP0, GX_COLOR0A0);
        if (shadowModelDrawF) {
            GXSetTevColorIn(GX_TEVSTAGE0, GX_CC_ONE, GX_CC_ZERO, GX_CC_ZERO, GX_CC_ZERO);
            GXSetZMode(GX_FALSE, GX_LEQUAL, GX_FALSE);
        }
        else {
            var_r21 = var_r31->unk_38->bmp->dataFmt & 0xF;
            if (var_r21 == 7 || var_r21 == 8) {
                GXSetTevColorIn(GX_TEVSTAGE0, GX_CC_ZERO, GX_CC_ONE, GX_CC_RASC, GX_CC_ZERO);
            }
            else {
                GXSetTevColorIn(GX_TEVSTAGE0, GX_CC_ZERO, GX_CC_TEXC, GX_CC_RASC, GX_CC_ZERO);
            }
            if (var_r31->unk_22 & 1) {
                GXSetZMode(GX_FALSE, GX_LEQUAL, GX_FALSE);
            }
            else if (arg0->attr & 2) {
                GXSetZMode(GX_TRUE, GX_LEQUAL, GX_TRUE);
            }
            else {
                GXSetZMode(GX_TRUE, GX_LEQUAL, GX_FALSE);
            }
        }
        GXSetTevColorOp(GX_TEVSTAGE0, GX_TEV_ADD, GX_TB_ZERO, GX_CS_SCALE_1, GX_TRUE, GX_TEVPREV);
        GXSetTevAlphaIn(GX_TEVSTAGE0, GX_CA_ZERO, GX_CA_TEXA, GX_CA_RASA, GX_CA_ZERO);
        GXSetTevAlphaOp(GX_TEVSTAGE0, GX_TEV_ADD, GX_TB_ZERO, GX_CS_SCALE_1, GX_TRUE, GX_TEVPREV);
        GXSetNumChans(1);
        GXSetChanCtrl(GX_COLOR0A0, GX_FALSE, GX_SRC_REG, GX_SRC_VTX, 0, GX_DF_CLAMP, GX_AF_NONE);
        HuSprTexLoad(var_r31->unk_38, 0, 0, GX_REPEAT, GX_REPEAT, GX_LINEAR);
        GXSetAlphaCompare(GX_GEQUAL, 1, GX_AOP_AND, GX_GEQUAL, 1);
        GXSetZCompLoc(GX_FALSE);
        switch (var_r31->unk_20) {
            case 0:
                GXSetBlendMode(GX_BM_BLEND, GX_BL_SRCALPHA, GX_BL_INVSRCALPHA, GX_LO_NOOP);
                break;
            case 1:
                GXSetBlendMode(GX_BM_BLEND, GX_BL_SRCALPHA, GX_BL_ONE, GX_LO_NOOP);
                break;
            case 2:
                GXSetBlendMode(GX_BM_BLEND, GX_BL_ZERO, GX_BL_INVDSTCLR, GX_LO_NOOP);
                break;
        }
        GXClearVtxDesc();
        GXSetVtxDesc(GX_VA_POS, GX_INDEX16);
        GXSetVtxAttrFmt(GX_VTXFMT0, GX_VA_POS, GX_POS_XYZ, GX_F32, 0);
        GXSETARRAY(GX_VA_POS, var_r31->unk_40, var_r31->unk_26 * sizeof(Vec) * 4, sizeof(Vec), TRUE);
        GXSetVtxDesc(GX_VA_CLR0, GX_INDEX16);
        GXSetVtxAttrFmt(GX_VTXFMT0, GX_VA_CLR0, GX_CLR_RGBA, GX_RGBA8, 0);
        GXSETARRAY(GX_VA_CLR0, &var_r31->unk_3C->unk_3C, var_r31->unk_26 * sizeof(*var_r31->unk_3C), sizeof(*var_r31->unk_3C), TRUE);
        GXSetVtxDesc(GX_VA_TEX0, GX_INDEX16);
        GXSetVtxAttrFmt(GX_VTXFMT0, GX_VA_TEX0, GX_TEX_ST, GX_F32, 0);
        GXSETARRAY(GX_VA_TEX0, var_r31->unk_44, var_r31->unk_26 * sizeof(Vec2f) * 4, sizeof(Vec2f), TRUE);
        if (HmfInverseMtxF3X3(arg1, sp128) == 0) {
            MTXIdentity(sp128);
        }
        MTXReorder(sp128, sp8);
        if (var_r31->unk_4C) {
            var_r18 = var_r31->unk_4C;
            var_r18(arg0, var_r31, arg1);
        }
        var_r29 = var_r31->unk_3C;
        var_r30 = var_r31->unk_40;
        var_r28 = var_r31->unk_44;
        MTXROMultVecArray(sp8, lbl_1_data_8E0, &sp38[0], 4);
        for (var_r26 = 0; var_r26 < var_r31->unk_26; var_r26++, var_r29++) {
            if (!var_r29->unk_28) {
                var_r30->x = var_r30->y = var_r30->z = 0.0f;
                var_r30++;
                var_r30->x = var_r30->y = var_r30->z = 0.0f;
                var_r30++;
                var_r30->x = var_r30->y = var_r30->z = 0.0f;
                var_r30++;
                var_r30->x = var_r30->y = var_r30->z = 0.0f;
                var_r30++;
            }
            else if (!var_r29->unk_2C) {
                var_r27 = &sp98[0];
                var_r24 = &sp38[0];
                VECScale(var_r24++, var_r27, var_r29->unk_28);
                VECAdd(var_r27++, &var_r29->unk_30, var_r30++);
                VECScale(var_r24++, var_r27, var_r29->unk_28);
                VECAdd(var_r27++, &var_r29->unk_30, var_r30++);
                VECScale(var_r24++, var_r27, var_r29->unk_28);
                VECAdd(var_r27++, &var_r29->unk_30, var_r30++);
                VECScale(var_r24++, var_r27, var_r29->unk_28);
                VECAdd(var_r27++, &var_r29->unk_30, var_r30++);
            }
            else {
                VECScale(lbl_1_data_8E0, &sp98[0], var_r29->unk_28);
                VECScale(&lbl_1_data_8E0[1], &sp98[1], var_r29->unk_28);
                VECScale(&lbl_1_data_8E0[2], &sp98[2], var_r29->unk_28);
                VECScale(&lbl_1_data_8E0[3], &sp98[3], var_r29->unk_28);
                MTXRotRad(spC8, 90, var_r29->unk_2C);
                MTXConcat(sp128, spC8, spF8);
                MTXMultVecArray(spF8, &sp98[0], &sp68[0], 4);
                VECAdd(&sp68[0], &var_r29->unk_30, var_r30++);
                VECAdd(&sp68[1], &var_r29->unk_30, var_r30++);
                VECAdd(&sp68[2], &var_r29->unk_30, var_r30++);
                VECAdd(&sp68[3], &var_r29->unk_30, var_r30++);
            }
        }
        var_r29 = var_r31->unk_3C;
        var_r28 = var_r31->unk_44;
        if ((var_r31->unk_22 & 2) == 0) {
            for (var_r26 = 0; var_r26 < var_r31->unk_26; var_r26++, var_r29++) {
                var_r20 = var_r29->unk_40 & 3;
                var_r19 = (var_r29->unk_40 >> 2) & 3;
                for (var_r25 = 0; var_r25 < 4; var_r25++, var_r28++) {
                    var_r28->x = (0.25f * var_r20) + lbl_1_data_910[var_r25].x;
                    var_r28->y = (0.25f * var_r19) + lbl_1_data_910[var_r25].y;
                }
            }
        }
        else {
            for (var_r26 = 0; var_r26 < var_r31->unk_26; var_r26++, var_r29++) {
                for (var_r25 = 0; var_r25 < 4; var_r25++, var_r28++) {
                    var_r28->x = 4.0f * lbl_1_data_910[var_r25].x;
                    var_r28->y = 4.0f * lbl_1_data_910[var_r25].y;
                }
            }
        }
        DCFlushRangeNoSync(var_r31->unk_40, var_r31->unk_26 * 0xC * 4);
        DCFlushRangeNoSync(var_r31->unk_44, var_r31->unk_26 * 8 * 4);
        DCFlushRangeNoSync(var_r31->unk_3C, var_r31->unk_26 * 0x44);
        PPCSync();
        GXCallDisplayList(var_r31->unk_48, var_r31->unk_34);
        if (!shadowModelDrawF) {
            if ((var_r31->unk_21 & 2) == 0) {
                var_r31->unk_28++;
            }
            if ((var_r31->unk_30 != 0) && (var_r31->unk_30 <= var_r31->unk_28)) {
                if (var_r31->unk_21 & 1) {
                    var_r31->unk_28 = 0;
                }
                var_r31->unk_28 = var_r31->unk_30;
            }
            var_r31->unk_2C = GlobalCounter;
        }
    }
}

s16 fn_1_C4F4(s16 arg0)
{
    Vec2f *sp8;

