zeranemesis/Marioparty4/partyboard/src/REL/m406Dll/map.c
    UnkM406Unk120Struct2 *var_r31;
    UnkM406Struct5 *var_r30;
    s16 var_r29;
    HU3DMODEL *var_r28;
    Vec *var_r27;
    void *var_r25;
    s16 var_r24;
    void *var_r23;

    var_r24 = Hu3DHookFuncCreate(fn_1_C86C);
    var_r28 = &Hu3DData[var_r24];
    var_r31 = HuMemDirectMallocNum(HEAP_DATA, sizeof(UnkM406Unk120Struct2), var_r28->mallocNo);
    var_r28->hookData = var_r31;
    var_r31->unk_38 = 0;
    var_r31->unk_26 = arg0;
    var_r31->unk_20 = 0;
    var_r31->unk_22 = 0;
    var_r31->unk_4C = 0;
    var_r31->unk_50 = 0;
    var_r31->unk_28 = 0;
    var_r31->unk_21 = 0;
    var_r31->unk_30 = 0;

    var_r31->unk_00 = var_r31->unk_02 = 0;
    var_r30 = HuMemDirectMallocNum(HEAP_DATA, arg0 * sizeof(UnkM406Struct5), var_r28->mallocNo);
    var_r31->unk_3C = var_r30;
    memset(var_r30, 0, arg0 * sizeof(UnkM406Struct5));
    for (var_r29 = 0; var_r29 < arg0; var_r29++, var_r30++) {
        var_r30->unk_28 = 0.0f;
        var_r30->unk_2C = 0.0f;
        var_r30->unk_30.x = ((frand() & 0x7F) - 0x40) * 0x14;
        var_r30->unk_30.y = ((frand() & 0x7F) - 0x40) * 0x1E;
        var_r30->unk_30.z = ((frand() & 0x7F) - 0x40) * 0x14;
        var_r30->unk_3C.r = var_r30->unk_3C.g = var_r30->unk_3C.b = var_r30->unk_3C.a = 0xFF;
        var_r30->unk_40 = 0;
    }
    var_r27 = HuMemDirectMallocNum(HEAP_DATA, arg0 * sizeof(Vec) * 4, var_r28->mallocNo);
    var_r31->unk_40 = var_r27;
    for (var_r29 = 0; var_r29 < (arg0 * 4); var_r29++, var_r27++) {
        var_r27->x = var_r27->y = var_r27->z = 0.0f;
    }
    var_r31->unk_44 = sp8 = NULL;
    var_r25 = HuMemDirectMallocNum(HEAP_DATA, 0x10000, var_r28->mallocNo);
    var_r23 = var_r25;
    DCFlushRange(var_r25, 0x10000);
    GXBeginDisplayList(var_r23, 0x10000);
    GXBegin(GX_QUADS, GX_VTXFMT0, arg0 * 4);
    for (var_r29 = 0; var_r29 < arg0; var_r29++) {
        GXPosition1x16(var_r29 * 4);
        GXColor1x16(var_r29);

        GXPosition1x16(var_r29 * 4 + 1);
        GXColor1x16(var_r29);

        GXPosition1x16(var_r29 * 4 + 2);
        GXColor1x16(var_r29);

        GXPosition1x16(var_r29 * 4 + 3);
        GXColor1x16(var_r29);
    }
    GXEnd();
    var_r31->unk_34 = GXEndDisplayList();
    var_r31->unk_48 = HuMemDirectMallocNum(HEAP_DATA, var_r31->unk_34, var_r28->mallocNo);
    memcpy(var_r31->unk_48, var_r25, var_r31->unk_34);
    DCFlushRange(var_r31->unk_48, var_r31->unk_34);
    HuMemDirectFree(var_r25);
    return var_r24;
}

void fn_1_C86C(HU3DMODEL *arg0, Mtx arg1)
{
    Mtx sp9C;
    ROMtx sp6C;
    ROMtx sp3C;
    ROMtx spC;
    Vec2f *sp8;

    UnkM406Unk120Struct2 *var_r31;
    Vec *var_r30;
    UnkM406Struct5 *var_r29;
    Vec *var_r28;
    Vec *var_r27;
    s16 var_r25;
    UnkM406Unk120Struct2Hook var_r23;

    var_r31 = arg0->hookData;
    if (var_r31->unk_2C != GlobalCounter || shadowModelDrawF) {
        if (var_r31->unk_50 && var_r31->unk_50 != arg0) {
            fn_1_C86C(var_r31->unk_50, arg1);
        }
        GXLoadPosMtxImm(arg1, 0);
        GXSetNumTevStages(1);
        GXSetNumTexGens(0);
        GXSetTexCoordGen2(GX_TEXCOORD0, GX_TG_MTX2x4, GX_TG_TEX0, 0x3C, GX_FALSE, 0x7D);
        GXSetTevOrder(GX_TEVSTAGE0, GX_TEXCOORD_NULL, GX_TEXMAP_NULL, GX_COLOR0A0);
        GXSetTevOp(GX_TEVSTAGE0, GX_PASSCLR);
        GXSetNumChans(1);
        GXSetChanCtrl(GX_COLOR0A0, GX_FALSE, GX_SRC_REG, GX_SRC_VTX, 0, GX_DF_CLAMP, GX_AF_NONE);
        GXSetAlphaCompare(GX_GEQUAL, 1, GX_AOP_AND, GX_GEQUAL, 1);
        GXSetZCompLoc(GX_FALSE);
        if (arg0->attr & 2) {
            GXSetZMode(GX_TRUE, GX_LEQUAL, GX_TRUE);
        }
        else {
            GXSetZMode(GX_TRUE, GX_LEQUAL, GX_FALSE);
        }
        switch (var_r31->unk_20) {
            case 0:
                GXSetBlendMode(GX_BM_BLEND, GX_BL_SRCALPHA, GX_BL_INVSRCALPHA, GX_LO_NOOP);
                break;
            case 1:
                GXSetBlendMode(GX_BM_BLEND, GX_BL_SRCALPHA, GX_BL_ONE, GX_LO_NOOP);
                break;
            case 2:
                GXSetBlendMode(GX_BM_BLEND, GX_BL_ZERO, GX_BL_INVDSTCLR, GX_LO_NOOP);
                break;
        }
        GXClearVtxDesc();
        GXSetVtxDesc(GX_VA_POS, GX_INDEX16);
        GXSetVtxAttrFmt(GX_VTXFMT0, GX_VA_POS, GX_POS_XYZ, GX_F32, 0);
        GXSETARRAY(GX_VA_POS, var_r31->unk_40, var_r31->unk_26 * sizeof(Vec) * 4, sizeof(Vec), TRUE);
        GXSetVtxDesc(GX_VA_CLR0, GX_INDEX16);
        GXSetVtxAttrFmt(GX_VTXFMT0, GX_VA_CLR0, GX_CLR_RGBA, GX_RGBA8, 0);
        GXSETARRAY(GX_VA_CLR0, &var_r31->unk_3C->unk_3C, sizeof(GXColor), 0x44, TRUE);
        if (HmfInverseMtxF3X3(arg1, sp9C) == 0) {
            MTXIdentity(sp9C);
        }
        MTXReorder(sp9C, spC);
        if (var_r31->unk_4C) {
            var_r23 = var_r31->unk_4C;
            var_r23(arg0, var_r31, arg1);
        }
        var_r29 = var_r31->unk_3C;
        var_r30 = var_r31->unk_40;
        sp8 = var_r31->unk_44;
        MTXROMultVecArray(spC, lbl_1_data_930, (Vec *)sp3C, 4);
        for (var_r25 = 0; var_r25 < var_r31->unk_26; var_r25++, var_r29++) {
            if (!var_r29->unk_28) {
                var_r30->x = var_r30->y = var_r30->z = 0.0f;
                var_r30++;
                var_r30->x = var_r30->y = var_r30->z = 0.0f;
                var_r30++;
                var_r30->x = var_r30->y = var_r30->z = 0.0f;
                var_r30++;
                var_r30->x = var_r30->y = var_r30->z = 0.0f;
                var_r30++;
            }
            else {
                var_r28 = (Vec *)&sp6C;
                var_r27 = (Vec *)&sp3C;
                VECScale(var_r27++, var_r28, var_r29->unk_28);
                VECAdd(var_r28++, &var_r29->unk_30, var_r30++);
                VECScale(var_r27++, var_r28, var_r29->unk_28);
                VECAdd(var_r28++, &var_r29->unk_30, var_r30++);
                VECScale(var_r27++, var_r28, var_r29->unk_28);
                VECAdd(var_r28++, &var_r29->unk_30, var_r30++);
                VECScale(var_r27++, var_r28, var_r29->unk_28);
                VECAdd(var_r28++, &var_r29->unk_30, var_r30++);
            }
        }
        DCFlushRangeNoSync(var_r31->unk_40, var_r31->unk_26 * 0xC * 4);
        DCFlushRangeNoSync(var_r31->unk_3C, var_r31->unk_26 * 0x44);
        PPCSync();
        GXCallDisplayList(var_r31->unk_48, var_r31->unk_34);
        if (!shadowModelDrawF) {
            if ((var_r31->unk_21 & 2) == 0) {
                var_r31->unk_28++;
            }
            if ((var_r31->unk_30 != 0) && (var_r31->unk_30 <= var_r31->unk_28)) {
                if (var_r31->unk_21 & 1) {
                    var_r31->unk_28 = 0;
                }
                var_r31->unk_28 = var_r31->unk_30;
            }
            var_r31->unk_2C = GlobalCounter;
        }
    }
}

