zeranemesis/Marioparty4/partyboard/src/REL/m406Dll/map.c
s32 fn_1_CD34(s32 arg0, s32 arg1, s32 arg2)
{
    HU3DMODEL *var_r29;
    HU3DMODEL *var_r30;
    s32 var_r31;

    var_r29 = &Hu3DData[arg0];
    var_r30 = &Hu3DData[arg2];
    for (var_r31 = 0; var_r31 < 8; var_r31++) {
        if (var_r30->lLightId[var_r31] == -1) {
            break;
        }
    }
    if (var_r31 == 8) {
        return -1;
    }
    var_r30->lLightId[var_r31] = var_r29->lLightId[arg1];
    var_r30->attr |= 0x1000;
    return var_r31;
}

void fn_1_CDD8(s32 arg0, float arg8, float arg9, float argA, float argB)
{
    HSFMATERIAL *var_r31;
    s32 var_r30;
    HSFDATA *var_r29;
    s32 var_r28;
    HU3DMODEL *var_r27;
    s32 var_r26;

    var_r27 = &Hu3DData[arg0];
    var_r29 = var_r27->hsf;
    var_r31 = var_r29->material;
    var_r26 = var_r29->materialNum;
    for (var_r28 = 0; var_r28 < var_r26; var_r28++, var_r31++) {
        var_r31->vtxMode = 1;
        var_r30 = arg9 * (var_r31->litColor[0] * arg8);
        if (var_r30 > 0xFF) {
            var_r30 = 0xFF;
        }
        var_r31->litColor[0] = var_r30;
        var_r30 = argA * (var_r31->litColor[1] * arg8);
        if (var_r30 > 0xFF) {
            var_r30 = 0xFF;
        }
        var_r31->litColor[1] = var_r30;
        var_r30 = argB * (var_r31->litColor[2] * arg8);
        if (var_r30 > 0xFF) {
            var_r30 = 0xFF;
        }
        var_r31->litColor[2] = var_r30;
    }
}

void fn_1_CF24(s32 arg0, u8 arg1, u8 arg2, u8 arg3)
{
    HSFMATERIAL *var_r31;
    HSFDATA *var_r30;
    s32 var_r29;
    HU3DMODEL *var_r28;
    s32 var_r27;

    var_r28 = &Hu3DData[arg0];
    var_r30 = var_r28->hsf;
    var_r31 = var_r30->material;
    var_r27 = var_r30->materialNum;
    for (var_r29 = 0; var_r29 < var_r27; var_r29++, var_r31++) {
        var_r31->vtxMode = 1;
        var_r31->litColor[0] = arg1;
        var_r31->litColor[1] = arg2;
        var_r31->litColor[2] = arg3;
    }
}

void fn_1_CF98(s32 arg0, s32 arg1)
{
    s32 var_r31;
    HSFDATA *var_r30;
    HSFDATA *var_r29;
    HU3DMODEL *var_r28;
    HU3DMODEL *var_r27;

    var_r28 = &Hu3DData[arg0];
    var_r27 = &Hu3DData[arg1];
    var_r29 = var_r28->hsf;
    var_r30 = var_r27->hsf;
    for (var_r31 = 0; var_r31 < var_r30->bitmapNum; var_r31++) {
        memcpy(&var_r30->bitmap[var_r31], &var_r29->bitmap[var_r31], 0x20);
    }
    for (var_r31 = 0; var_r31 < var_r30->attributeNum; var_r31++) {
        memcpy(&var_r30->attribute[var_r31], &var_r29->attribute[var_r31], 0x84);
    }
}

s16 fn_1_D06C(HU3DMODEL *arg0, Mtx arg1, Mtx arg2, float arg8)
{
    s16 var_r31;
    s16 var_r29;
    s16 var_r28;
    HU3DLIGHT *var_r27;

    var_r28 = 0;
    var_r29 = 1;
    if (arg0->attr & 0x1000) {
        for (var_r31 = 0; var_r31 < 8; var_r31++) {
            if (arg0->lLightId[var_r31] != -1) {
                var_r27 = &Hu3DLocalLight[arg0->lLightId[var_r31]];
                fn_1_D13C(var_r27, var_r29, arg2, arg1, arg8);
                var_r28 |= var_r29;
                var_r29 <<= 1;
            }
        }
    }
    return var_r28;
}

void fn_1_D13C(HU3DLIGHT *arg0, s16 arg1, Mtx arg2, Mtx arg3, float arg8)
{
    GXLightObj sp30;
    Vec sp24;
    Vec sp18;

    switch ((u8)arg0->type) {
        case 0:
            GXInitLightAttn(&sp30, 1.0f, 0.0f, 0.0f, 1.0f, 0.0f, 0.0f);
            GXInitLightSpot(&sp30, arg0->cutoff, arg0->func);
            break;
        case 1:
            GXInitLightAttn(&sp30, 1.0f, 0.0f, 0.0f, 1.0f, 0.0f, 0.0f);
            GXInitLightSpot(&sp30, 20.0f, GX_SP_COS);
            GXInitLightAttnK(&sp30, 1.0f, 0.0f, 0.0f);
            VECScale(&arg0->dir, &arg0->pos, -1000000.0f);
            break;
        case 2:
            GXInitLightAttn(&sp30, 1.0f, 0.0f, 0.0f, 0.0f, 0.0f, 0.0f);
            GXInitLightDistAttn(&sp30, arg0->cutoff, arg0->brightness, arg0->func);
            break;
        default:
            break;
    }
    if (arg0->type & 0x8000) {
        MTXMultVec(arg2, &arg0->dir, &sp24);
        MTXMultVec(arg3, &arg0->pos, &sp18);
        GXInitLightPos(&sp30, sp18.x, sp18.y, sp18.z);
    }
    else {
        GXInitLightPos(&sp30, arg0->pos.x, arg0->pos.y, arg0->pos.z);
        sp24 = arg0->dir;
    }
    if (arg8 == 0.0f) {
        GXInitLightDir(&sp30, sp24.x, sp24.y, sp24.z);
    }
    else {
        GXInitSpecularDir(&sp30, sp24.x, sp24.y, sp24.z);
        GXInitLightAttn(&sp30, 0.0f, 0.0f, 1.0f, arg8 / 2, 0.0f, 1.0f - (arg8 / 2));
    }
    GXInitLightColor(&sp30, arg0->color);
    GXLoadLightObjImm(&sp30, arg1);
}

void fn_1_D488(float arg8, Vec *arg0, Vec *arg1, Vec *arg2)
{
    lbl_1_bss_3C.x = arg0->x + (arg8 * (arg1->x - arg0->x));
    lbl_1_bss_3C.y = arg0->y + (arg8 * (arg1->y - arg0->y));
    lbl_1_bss_3C.z = arg0->z + (arg8 * (arg1->z - arg0->z));
    *arg2 = lbl_1_bss_3C;
}

void fn_1_D518(Mtx arg0, Vec *arg1)
{
    Vec sp8;

    sp8.x = (arg0[0][2] * arg1->z) + ((arg0[0][0] * arg1->x) + (arg0[0][1] * arg1->y));
    sp8.y = (arg0[1][2] * arg1->z) + ((arg0[1][0] * arg1->x) + (arg0[1][1] * arg1->y));
    sp8.z = (arg0[2][2] * arg1->z) + ((arg0[2][0] * arg1->x) + (arg0[2][1] * arg1->y));
    *arg1 = sp8;
}

float fn_1_D5CC(Vec *arg0, Vec *arg1, float arg8, float arg9)
{
    float var_f31;
    float var_f30;
    float var_f29;
    float var_f28;
    float var_f27;

    var_f31 = arg0->x - arg8;
    var_f30 = arg0->z - arg9;
    var_f29 = arg1->x - arg8;
    var_f28 = arg1->z - arg9;

    var_f27 = -((var_f30 * var_f29) - (var_f31 * var_f28));
    return var_f27;
}
